ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/*
** ###################################################################
**
**     Abstract:
**         Chip specific module features.
**
**     Copyright 2018 NXP
**     All rights reserved.
**
**     THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
**     IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
**     OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
**     IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
**     INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
**     SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
**     HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
**     STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
**     IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
**     THE POSSIBILITY OF SUCH DAMAGE.
**
**
** ###################################################################
*/

/*!
 * @file MPC5777C_features.h
 *
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, Global typedef not referenced.
 * Type used only in some modules of the SDK.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, Global macro not referenced.
 * The macros defined are used to define features for each driver, so this might be reported
 * when the analysis is made only on one driver.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are very simple macros used for abstracting hw implementation.
 * They help make the code easy to understand.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 */

#if !defined(MPC5777C_FEATURES_H)
#define MPC5777C_FEATURES_H

/* include device_registers.h for SIU module configuration structures */
#include "device_registers.h"

/* ERRATA sections*/

/* @brief E9595 FlexCAN: Corrupted frame possible if Freeze Mode or Low Power Mode are
 * entered during a Bus-Off state. if the Freeze Enable bit (FRZ) of the Module Configuration
 * Register (MCR) is asserted and the Freeze Mode is requested by asserting the Halt bit (HALT) of
 * the MCR register during the Bus Off state, the transmission after exiting the Bus-Off condition
 * will be corrupted. The issue occurs only if a transmission is pending before the freeze mode request.
 * This errata applies to mask 3N45H for MPC5777C CPU.
 */
#define ERRATA_E9595

/* @brief E9527 FlexCAN: The transmission abort mechanism may not work properly
 * The Flexible Controller Area NEtwork (FlexCAN) is not able to abort a transmission frame and
 * the abort process may remain pending in the following cases:
 * a) If a pending abort request occurs while the FlexCAN is receiving a remote frame.
 * b) When a frame is aborted during an overload frame after a frame reception.
 * c) When an abort is requested while the FlexCAN has just started a transmission.
 * d) When Freeze Mode request occurs and the FlexCAN has just started a transmission.
 * This errata applies to mask 3N45H for MPC5777C CPU.
 */
#define ERRATA_E9527

/* @brief E6906 SDADC: Invalid conversion data when output settling delay value is less than 23.
 * This errata applies to mask 3N45H for MPC5777C CPU.
 */
#define ERRATA_E6906

/* @brief E8631 SDADC: Low threshold watchdog cannot be used with signed data.
 * This errata applies to mask 3N45H for MPC5777C CPU.
 */
#define ERRATA_E8631

/* @brief E8710 SDADC: Watchdog Crossover event missed if FM Peripheral Clock frequency is
 * less than or equal to the sigma-delta ADC clock frequency.
 * This errata applies to mask 3N45H for MPC5777C CPU.
 */
#define ERRATA_E8710

/* @brief E10415 SDADC: Additional DMA requests generated when using watchdog threshold
 * crossover event.
 * This errata applies to mask 3N45H for MPC5777C CPU.
 */
#define ERRATA_E10415

/* @brief E7204: SENT: Number of Expected Edges Error status flag spuriously set when
 * operating with Option 1 of the Successive Calibration Check method */
#define ERRATA_E7204

/* @brief E7425: SENT: Unexpected NUM_EDGES_ERR error in certain conditions when
 * message has a pause pulse */
#define ERRATA_E7425

/* @brief E50130 PIT: Temporary incorrect value reported in LMTR64H register in lifetimer mode */
#define ERRATA_E50130

/* @brief Number of cores. */
#define NUMBER_OF_CORES (2u)

/* WDOG module features */

/* @brief The key values to clear Soft Lock bit */
#define FEATURE_WDOG_UNLOCK_VALUE1  (0xC520U)
#define FEATURE_WDOG_UNLOCK_VALUE2  (0xD928U)

/* PIT module features */

/*! @brief PIT module has RTI channel */
#define FEATURE_PIT_HAS_RTI_CHANNEL    (1U)
/*! @brief Number of interrupt vector for channels of the PIT module */
#define FEATURE_PIT_HAS_NUM_IRQS_CHANS (PIT_IRQS_CH_COUNT)
/*! @brief PIT module has a peculiar instance */
#define FEATURE_PIT_HAS_PECULIAR_INSTANCE   (0U)
/*! @brief The default value of MDIS bit */
#define PIT_MCR_MDIS_DEFAULT                (0U)
/*! @brief PIT instance has not lifetime timer */
#define PIT_INSTANCE_HAS_NOT_LIFETIME_TIMER      (0U)

#if PIT_INSTANCE_HAS_NOT_LIFETIME_TIMER
/*! @brief PIT instance base has not lifetime timer */
#define PIT_INSTANCE_BASE_HAS_NOT_LIFETIME_TIMER   (PIT_0)
#endif

#if FEATURE_PIT_HAS_PECULIAR_INSTANCE
/*! @brief The peculiar instance */
#define PIT_PECULIAR_INSTANCE    (1U)
/*! @brief The number channel of the peculiar instance */
#define PIT_CHAN_NUM_OF_PECULIAR_INSTANCE   (4U)
#endif

#if FEATURE_PIT_HAS_RTI_CHANNEL
/*! @brief The default value of MDIS-RTI bit */
#define PIT_MCR_MDIS_RTI_DEFAULT            (0U)
/*! @brief Clock names for RTI. */
#define RTI_CLOCK_NAMES    {PITRTI0_CLK}
#endif
/*! @brief Clock names for PIT. */
#define PIT_CLOCK_NAMES    {PIT0_CLK}

/* SWI2C features */
#define SWI2C_INSTANCE_COUNT                   0xFFU

