ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* STM module features */

/*! @brief STM module CR register has CSL bit-field */
#define FEATURE_STM_HAS_CLOCK_SELECTION (0U)
/*! @brief Number of interrupt vector for channels of the STM module */
#define FEATURE_STM_HAS_NUM_IRQS_CHANS  (2U)
/*! @brief Clock names for STM. */
#define STM_CLOCK_NAMES    { PBRIDGEx_CLK }

/* SWT module features */

/* @brief Support service mode watchpoint input */
#define FEATURE_SWT_SUPPORT_WATCHPOINT      (0U)
/* @brief Support for clock selection */
#define FEATURE_SWT_HAS_CLOCK_SELECT        (1U)
/* @brief Support for running in stop mode */
#define FEATURE_SWT_HAS_STOP_MODE           (1U)
/* @brief The key values to clear Soft Lock bit */
#define FEATURE_SWT_UNLOCK_VALUE1           (0xC520U)
#define FEATURE_SWT_UNLOCK_VALUE2           (0xD928U)
/* @brief The key values used for resetting the SWT counter in Fixed Service Sequence Mode */
#define FEATURE_SWT_FIXED_SERVICE_VALUE1    (0xA602U)
#define FEATURE_SWT_FIXED_SERVICE_VALUE2    (0xB480U)
/* @brief The reset value of the control register */
#define FEATURE_SWT_CR_RESET_VALUE          (0xFF00011AU)
/* @brief The reset value of the timeout register */
#define FEATURE_SWT_TO_RESET_VALUE          (0x3FDE0U)
/* @brief The reset value of the window register */
#define FEATURE_SWT_WN_RESET_VALUE          (0x0U)
/* @brief The reset value of the service key register */
#define FEATURE_SWT_SK_RESET_VALUE          (0x0U)
/* @brief The minimum timeout value */
#define FEATURE_SWT_TO_MINIMUM_VALUE        (0x100U)
/* @brief Sets the master access protection field */
#define FEATURE_SWT_MAP_MASK                (0xFF000000U)
#define FEATURE_SWT_MAP_SHIFT               (24U)
#define FEATURE_SWT_MAP(x)                  (((uint32_t)(((uint32_t)(x)) << FEATURE_SWT_MAP_SHIFT)) & FEATURE_SWT_MAP_MASK)

/* WKPU module features */

/* @brief WKPU core source. */
typedef enum
{
    WKPU_CORE0    = 0U    /*!< Core 0 */
} wkpu_core_t;

/* @brief The WKPU core array */
#define FEATURE_WKPU_CORE_ARRAY     \
{                                   \
    WKPU_CORE0    /*!< Core 0 */    \
}

/*! @brief The number core support for WKPU module */
#define FEATURE_WKPU_NMI_NUM_CORES                      (1U)
/*! @brief The distance between cores */
#define FEATURE_WKPU_CORE_OFFSET_SIZE                   (8U)
/*! @brief WKPU support non-maskable interrupt */
#define FEATURE_WKPU_SUPPORT_NON_MASK_INT               (1U)
/*! @brief WKPU support critical interrupt */
#define FEATURE_WKPU_SUPPORT_CRITICAL_INT               (2U)
/*! @brief WKPU support machine check request interrupt */
#define FEATURE_WKPU_SUPPORT_MACHINE_CHK_REQ            (3U)
/*! @brief WKPU  isn't generated NMI, critical interrupt, or machine check request  */
#define FEATURE_WKPU_SUPPORT_NONE_REQUEST               (4U)

/* SEMA42 module features */

/* @brief The SEMA42 Logical Bus Master Number for Core Z4a master */
#define FEATURE_SEMA42_MASTER_CORE_Z7A         (0U)
/* @brief The SEMA42 Logical Bus Master Number for Core Z4b master */
#define FEATURE_SEMA42_MASTER_CORE_Z7B         (1U)

/* @brief The SMPU Logical Bus Masters */
#define FEATURE_SEMA42_MASTER                      \
{                                                  \
FEATURE_SEMA42_MASTER_CORE_Z7A,  /* CORE Z7A */    \
FEATURE_SEMA42_MASTER_CORE_Z7B,  /* CORE Z7B */    \
}

/* @brief The notification interrupt available when failed to lock gates */
#define FEATURE_SEMA42_NOTIFICATION_INTERRUPT_AVAILABLE

#if defined (FEATURE_SEMA42_NOTIFICATION_INTERRUPT_AVAILABLE)
#define SEMA42_CPINE_INE_MASK                    0xFFFFu
#define SEMA42_CPINE_INE_SHIFT                   0u
#define SEMA42_CPINE_INE_WIDTH                   16u
#define SEMA42_CPINE_INE(x)                      (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE_SHIFT))&SEMA42_CPINE_INE_MASK)

#endif		/* defined (FEATURE_SEMA42_NOTIFICATION_INTERRUPT_AVAILABLE) */

#define FEATURE_SEMA42_INTERRUPT_ENABLE_SWAPPED

#if defined FEATURE_SEMA42_INTERRUPT_ENABLE_SWAPPED
#define FEATURE_SEMA42_SWAP_MASK(X) (((uint32_t)1U) << (SEMA42_CPINE_INE_WIDTH - (X + 1U)));
#define FEATURE_SEMA42_INV_SWAP_MASK(X) ((uint32_t)(~((uint32_t)1U) << (SEMA42_CPINE_INE_WIDTH - (X + 1U))));
#endif      /* defined (FEATURE_SEMA42_INTERRUPT_ENABLE_SWAPPED) */

/* ERM module features */

/*! @brief ERM module supports bit position of last ECC event */
#define FEATURE_ERM_ECC_BIT_POS
/*! @brief ERM number of instances */
#define FEATURE_ERM_INST_COUNT (1U)
/*! @brief ERM number of Configuration/Status Registers per instance */
#define FEATURE_ERM_CRn_SRn_COUNT (3U)
/*! @brief ERM Configuration Register Base Addresses */
#define FEATURE_ERM_CRn_BASE_ADDRS {{&ERM->CR0, &ERM->CR1, &ERM->CR2}}
/*! @brief ERM Status Register Base Addresses */
#define FEATURE_ERM_SRn_BASE_ADDRS {{&ERM->SR0, &ERM->SR1, &ERM->SR2}}

/* CRC module features */

/* @brief CRC module use for C55. */
#define FEATURE_CRC_DRIVER_HARD_POLYNOMIAL
/* @brief Default CRC read transpose */
#define FEATURE_CRC_DEFAULT_READ_TRANSPOSE      false
/* @brief Default CRC write transpose */
#define FEATURE_CRC_DEFAULT_WRITE_TRANSPOSE     CRC_TRANSPOSE_BITS
/* @brief Default CRC bit mode polynomial */
#define FEATURE_CRC_DEFAULT_POLYNOMIAL          CRC_BITS_16_CCITT
/* @brief Default seed value is 0xFFFFU */
#define FEATURE_CRC_DEFAULT_SEED                (0xFFFFU)
/* @brief CRC-8-H2F Autosar polynomial support */
#define FEATURE_CRC_BITS_8_H2F                  (0U)

/* SWI2C features */
#define SWI2C_INSTANCE_COUNT                   0xFFU


/* MPU module features */

/* @brief Specifies hardware revision level. */
#define FEATURE_MPU_HARDWARE_REVISION_LEVEL              (1U)
/* @brief Has process identifier support. */
#define FEATURE_MPU_HAS_PROCESS_IDENTIFIER               (1U)
/* @brief The number of master has process identifier. */
#define FEATURE_MPU_NUM_MASTER_HAS_PROCESS_IDENTIFIER    (4U)
/* Reset value of all master access right in region 0 */
#define FEATURE_MPU_REGION_0_ACCESS_RIGHT_RESET_VALUE    (0x00618600U)
/* @brief Specifies total number of bus masters. */
#define FEATURE_MPU_MASTER_COUNT                         (7U)
/* @brief Specifies maximum number of masters which have separated
privilege rights for user and supervisor mode accesses (e.g. master 0~3). */
#define FEATURE_MPU_MAX_LOW_MASTER_NUMBER                (3U)
/* @brief Specifies maximum number of masters which have only
read and write permissions (e.g. master 4~7). */
#define FEATURE_MPU_MAX_HIGH_MASTER_NUMBER               (7U)
/* @brief Specifies number of set access control right bits for
   masters which have separated privilege rights for user and
   supervisor mode accesses (e.g. master 0~3). */
#define FEATURE_MPU_LOW_MASTER_CONTROL_WIDTH             (6U)
/* @brief Specifies number of set access control right bits for
   masters which have only read and write permissions(e.g. master 4~7). */
#define FEATURE_MPU_HIGH_MASTER_CONTROL_WIDTH            (2U)

