ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* @brief The MPU Logical Bus Master Number for core 0 master. */
#define FEATURE_MPU_MASTER_CORE0                         (0U)
/* @brief The MPU Logical Bus Master Number for core 1 master. */
#define FEATURE_MPU_MASTER_CORE1                         (1U)
/* @brief The MPU Logical Bus Master Number for FEC master. */
#define FEATURE_MPU_MASTER_FEC                           (2U)
/* @brief The MPU Logical Bus Master Number for CSE master. */
#define FEATURE_MPU_MASTER_CSE                           (3U)
/* @brief The MPU Logical Bus Master Number for eDMA_A master. */
#define FEATURE_MPU_MASTER_eDMA_A                        (4U)
/* @brief The MPU Logical Bus Master Number for eDMA_B master. */
#define FEATURE_MPU_MASTER_eDMA_B                        (5U)
/* @brief The MPU Logical Bus Master Number for SIPI master. */
#define FEATURE_MPU_MASTER_SIPI                          (6U)
/* @brief Specifies master number. */
#define FEATURE_MPU_MASTER                        \
{                                                 \
    FEATURE_MPU_MASTER_CORE0,     /*!< CORE 0 */  \
    FEATURE_MPU_MASTER_CORE1,     /*!< CORE 1 */  \
    FEATURE_MPU_MASTER_FEC,       /*!< FEC */     \
    FEATURE_MPU_MASTER_CSE,       /*!< CSE */     \
    FEATURE_MPU_MASTER_eDMA_A,    /*!< eDMA_A */  \
    FEATURE_MPU_MASTER_eDMA_B,    /*!< eDMA_B */  \
    FEATURE_MPU_MASTER_SIPI       /*!< SIPI */    \
}

/* @brief Specifies total number of slave ports. */
#define FEATURE_MPU_SLAVE_COUNT                          (3U)
/* @brief The MPU Slave Port Assignment for EBI. */
#define FEATURE_MPU_SLAVE_EBI                            (0U)
/* @brief The MPU Slave Port Assignment for PRAMC. */
#define FEATURE_MPU_SLAVE_PRAMC                          (1U)
/* @brief The MPU Slave Port Assignment for Peripheral Bridge. */
#define FEATURE_MPU_SLAVE_AIPS                           (2U)
/* @brief The MPU Slave Port mask. */
#define FEATURE_MPU_SLAVE_MASK                           MPU_CESR_SPERR_MASK
#define FEATURE_MPU_SLAVE_SHIFT                          MPU_CESR_SPERR_SHIFT
#define FEATURE_MPU_SLAVE_WIDTH                          MPU_CESR_SPERR_WIDTH
#define FEATURE_MPU_SLAVE(x)                             MPU_CESR_SPERR(x)

/* @brief Fast XOSC clock frequency(40MHz). */
#define FEATURE_XOSC0_FREQ  (40000000U)

#define CMU_RCDIV_IS_NOT_SUPPORTED        (255U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU0    (0U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU1    (1U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU2    (2U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU3    (3U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU4    (4U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU5    (5U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU6    (6U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU7    (7U)
#define CMU_RCDIV_IS_SUPPORTED_BY_CMU8    (8U)

#define FEATURE_HAS_RCDIV				  CMU_RCDIV_IS_SUPPORTED_BY_CMU0
#define FEATURE_HAS_RCDIV1				  CMU_RCDIV_IS_NOT_SUPPORTED
#define FIRST_CMU						  CMU
#define CMU_RESET_DIVIDER_VALUE 		  (3U)

/*! @brief Clock names. */
typedef enum {
    /* Clock sources */
    IRCOSC_CLK                     = 0u,      /*!< IRCOSC_CLK clock source                */
    XOSC_CLK                       = 1u,      /*!< XOSC_CLK clock source                  */
    PLL0_PHI0_CLK                  = 2u,      /*!< PLL0_PHI0_CLK clock source             */
    PLL0_PHI1_CLK                  = 3u,      /*!< PLL0_PHI1_CLK clock source             */
    PLL1_PHI0_CLK                  = 4u,      /*!< PLL1_PHI0_CLK clock source             */
    END_OF_CLK_SOURCES             = 20u,      /*!< End of clock sources                  */
    /* System and common clocks */
    SCS_CLK                        = 21u,      /*!< SCS_CLK common clock                  */
    SYS_CLK                        = 22u,      /*!< SYS_CLK common clock                  */
    PLAT_CLK                       = 23u,      /*!< PLAT_CLK common clock                 */
    PBRIDGEx_CLK                   = 24u,      /*!< PBRIDGEx_CLK common clock             */
    PER_CLK_SEL_CLK                = 25u,      /*!< PER_CLK_SEL_CLK common clock          */
    PER_CLK                        = 26u,      /*!< PER_CLK common clock                  */
    CORE_CLK                       = 27u,      /*!< CORE_CLK                              */
    END_OF_SYSTEM_CLKS             = 40u,      /*!< End of common and system clocks       */
    END_OF_SCS_CLKS                = 41u,      /*!< End of SCS_CLK clocks                 */
    END_OF_CORE_CLKS               = 42u,      /*!< End of CORE_CLK clocks                */
    SIPI0_CLK                      = 43u,      /*!< SIPI0_CLK clock source                */
    END_OF_PLAT_CLKS               = 44u,      /*!< End of PLAT_CLK clocks                */
    FEC0_CLK                       = 45u,      /*!< FEC0_CLK clock source                 */
    END_OF_PBRIDGEx_CLKS           = 46u,      /*!< End of PBRIDGEx_CLK clocks            */
    ADCSD1_CLK                     = 47u,      /*!< ADCSD1_CLK clock source               */
    ADCSD2_CLK                     = 48u,      /*!< ADCSD2_CLK clock source               */
    ADCSD3_CLK                     = 49u,      /*!< ADCSD3_CLK clock source               */
    ADCSD4_CLK                     = 50u,      /*!< ADCSD4_CLK clock source               */
    ETPU0_CLK                      = 51u,      /*!< ETPU0_CLK clock source                */
    ETPU1_CLK                      = 52u,      /*!< ETPU1_CLK clock source                */
    PSI5RX0_CLK                    = 53u,      /*!< PSI5RX0_CLK clock source              */
    PSI5RX1_CLK                    = 54u,      /*!< PSI5RX1_CLK clock source              */
    PSI51us0_CLK                   = 55u,      /*!< PSI51us0_CLK clock source             */
    PSI51us1_CLK                   = 56u,      /*!< PSI51us1_CLK clock source             */
    END_OF_PER_CLK_SEL_CLKS        = 57u,      /*!< End of PER_CLK_SEL_CLK clocks         */
    DECFILT0_CLK                   = 58u,      /*!< DECFILT0_CLK clock source             */
    DECFILT1_CLK                   = 59u,      /*!< DECFILT1_CLK clock source             */
    DECFILT2_CLK                   = 60u,      /*!< DECFILT2_CLK clock source             */
    DECFILT3_CLK                   = 61u,      /*!< DECFILT3_CLK clock source             */
    DECFILT4_CLK                   = 62u,      /*!< DECFILT4_CLK clock source             */
    DECFILT5_CLK                   = 63u,      /*!< DECFILT5_CLK clock source             */
    DECFILT6_CLK                   = 64u,      /*!< DECFILT6_CLK clock source             */
    DECFILT7_CLK                   = 65u,      /*!< DECFILT7_CLK clock source             */
    DECFILT8_CLK                   = 66u,      /*!< DECFILT8_CLK clock source             */
    DECFILT9_CLK                   = 67u,      /*!< DECFILT9_CLK clock source             */
    DECFILT10_CLK                  = 68u,      /*!< DECFILT10_CLK clock source            */
    DECFILT11_CLK                  = 69u,      /*!< DECFILT11_CLK clock source            */
    DSPI0_CLK                      = 70u,      /*!< DSPI0_CLK clock source                */
    DSPI1_CLK                      = 71u,      /*!< DSPI1_CLK clock source                */
    DSPI2_CLK                      = 72u,      /*!< DSPI2_CLK clock source                */
    DSPI3_CLK                      = 73u,      /*!< DSPI3_CLK clock source                */
    DSPI4_CLK                      = 74u,      /*!< DSPI4_CLK clock source                */
    eSCI0_CLK                      = 75u,      /*!< eSCI0_CLK clock source                */
    eSCI1_CLK                      = 76u,      /*!< eSCI1_CLK clock source                */
    eSCI2_CLK                      = 77u,      /*!< eSCI2_CLK clock source                */
    eSCI3_CLK                      = 78u,      /*!< eSCI3_CLK clock source                */
    eSCI4_CLK                      = 79u,      /*!< eSCI4_CLK clock source                */
    eSCI5_CLK                      = 80u,      /*!< eSCI5_CLK clock source                */
    eMIOS0_CLK                     = 81u,      /*!< eMIOS0_CLK clock source               */
    eMIOS1_CLK                     = 82u,      /*!< eMIOS1_CLK clock source               */
    EQADC0_CLK                     = 83u,      /*!< EQADC0_CLK clock source               */
    EQADC1_CLK                     = 84u,      /*!< EQADC1_CLK clock source               */
    PIT0_CLK                       = 85u,      /*!< PIT0_CLK clock source                 */
    SENT0_CLK                      = 86u,      /*!< SENT0_CLK clock source                */
    SENT1_CLK                      = 87u,      /*!< SENT1_CLK clock source                */
    END_OF_PER_CLKS                = 88u,      /*!< End of PER_CLK clocks                 */
    LFAST0_CLK                     = 89u,      /*!< LFAST0_CLK clock source               */
    END_OF_LFAST_CLKS              = 90u,      /*!< End of LFAST_CLK clocks               */
    MCAN0_CLK                      = 91u,      /*!< MCAN0_CLK clock source                */
    MCAN1_CLK                      = 92u,      /*!< MCAN1_CLK clock source                */
    END_OF_CAN_CLKS                = 93u,      /*!< End of CAN_CLK clocks                 */
    PITRTI0_CLK                    = 94u,      /*!< PITRTI0_CLK clock source              */
    END_OF_XOSC_CLK_CLKS           = 95u,      /*!< End of XOSC_CLK_CLK clocks            */
    CSE0_CLK                       = 96u,      /*!< CSE0_CLK clock source                 */
    CRC0_CLK                       = 97u,      /*!< CRC0_CLK clock source                 */
    EBI0_CLK                       = 98u,      /*!< EBI0_CLK clock source                 */
    NPC0_CLK                       = 99u,      /*!< NPC0_CLK clock source                 */
    STCU0_CLK                      = 100u,      /*!< STCU0_CLK clock source               */
	DMA0_CLK                       = 101u,      /*!< DMA0 clock source                    */
	DMA1_CLK                       = 102u,      /*!< DMA1 clock source                    */
	FLEXCAN0_CLK                   = 103u,      /*!< FLEXCAN0_CLK clock source            */
	FLEXCAN1_CLK                   = 104u,      /*!< FLEXCAN1_CLK clock source            */
	FLEXCAN2_CLK                   = 105u,      /*!< FLEXCAN2_CLK clock source            */
	FLEXCAN3_CLK                   = 106u,      /*!< FLEXCAN3_CLK clock source            */
    END_OF_PERIPHERAL_CLKS         = 107u,      /*!< End of peripheral clocks             */
    CLOCK_NAME_COUNT,
} clock_names_t;


  /*! @brief interface clocks
   *  Mappings between clock names and interface clocks.
   *  If no interface clock exists for a given clock name,
   *  then the corresponding value is CLOCK_NAME_COUNT.
   */
#define MONITORED_CLOCKS \
{                                                           \
CMU_0,          /*!< IRCOSC_CLK clock                0   */ \
CMU_0,          /*!< XOSC_CLK clock                  1   */ \
CMU_0,          /*!< PLL0_PHI0_CLK clock             2   */ \
NULL,           /*!< PLL0_PHI1_CLK clock             3   */ \
NULL,           /*!< PLL1_PHI0_CLK clock             4   */ \
NULL,           /*!< No clock entry in clock_names_t 5   */ \
NULL,           /*!< No clock entry in clock_names_t 6   */ \
NULL,           /*!< No clock entry in clock_names_t 7   */ \
NULL,           /*!< No clock entry in clock_names_t 8   */ \
NULL,           /*!< No clock entry in clock_names_t 9   */ \
NULL,           /*!< No clock entry in clock_names_t 10  */ \
NULL,           /*!< No clock entry in clock_names_t 11  */ \
NULL,           /*!< No clock entry in clock_names_t 12  */ \
NULL,           /*!< No clock entry in clock_names_t 13  */ \
NULL,           /*!< No clock entry in clock_names_t 14  */ \
NULL,           /*!< No clock entry in clock_names_t 15  */ \
NULL,           /*!< No clock entry in clock_names_t 16  */ \
NULL,           /*!< No clock entry in clock_names_t 17  */ \
NULL,           /*!< No clock entry in clock_names_t 18  */ \
NULL,           /*!< No clock entry in clock_names_t 19  */ \
NULL,           /*!< END_OF_CLK_SOURCES              20  */ \
NULL,           /*!< SCS_CLK clock                   21  */ \
NULL,           /*!< SYS_CLK clock                   22  */ \
CMU_2,           /*!< PLAT_CLK clock                 23  */ \
NULL,           /*!< PBRIDGEx_CLK clock              24  */ \
CMU_3,           /*!< PER_CLK_SEL_CLK clock          25  */ \
CMU_5,           /*!< PER_CLK clock                  26  */ \
CMU_1,           /*!< CORE_CLK clock                 27  */ \
NULL,           /*!< No clock entry in clock_names_t 28  */ \
NULL,           /*!< No clock entry in clock_names_t 29  */ \
NULL,           /*!< No clock entry in clock_names_t 30  */ \
NULL,           /*!< No clock entry in clock_names_t 31  */ \
NULL,           /*!< No clock entry in clock_names_t 32  */ \
NULL,           /*!< No clock entry in clock_names_t 33  */ \
NULL,           /*!< No clock entry in clock_names_t 34  */ \
NULL,           /*!< No clock entry in clock_names_t 35  */ \
NULL,           /*!< No clock entry in clock_names_t 36  */ \
NULL,           /*!< No clock entry in clock_names_t 37  */ \
NULL,           /*!< No clock entry in clock_names_t 38  */ \
NULL,           /*!< No clock entry in clock_names_t 39  */ \
NULL,           /*!< END_OF_SYSTEM_CLOCKS            40  */ \
NULL,           /*!< End of SCS clocks               41  */ \
NULL,           /*!< End of CORE clocks              42  */ \
NULL,           /*!< SIPI0 clock                     43  */ \
NULL,           /*!< End of PLAT clocks              44  */ \
NULL,           /*!< FEC0 clock                      45  */ \
NULL,           /*!< End of PBRIDGEx clocks          46  */ \
CMU_6,           /*!< ADCSD1 clock                   47  */ \
CMU_6,           /*!< ADCSD2 clock                   48  */ \
CMU_6,           /*!< ADCSD3 clock                   49  */ \
CMU_6,           /*!< ADCSD4 clock                   50  */ \
CMU_4,           /*!< ETPU0 clock                    51  */ \
CMU_4,           /*!< ETPU1 clock                    52  */ \
CMU_7,           /*!< PSI5RX0 clock                  53  */ \
CMU_7,           /*!< PSI5RX1 clock                  54  */ \
CMU_8,           /*!< PSI51us0 clock                 55  */ \
CMU_8,           /*!< PSI51us1 clock                 56  */ \
NULL,           /*!< End of PER_CLK_SEL clocks       57  */ \
NULL,           /*!< DECFILT0 clock                  58  */ \
NULL,           /*!< DECFILT1 clock                  59  */ \
NULL,           /*!< DECFILT2 clock                  60  */ \
NULL,           /*!< DECFILT3 clock                  61  */ \
NULL,           /*!< DECFILT4 clock                  62  */ \
NULL,           /*!< DECFILT5 clock                  63  */ \
NULL,           /*!< DECFILT6 clock                  64  */ \
NULL,           /*!< DECFILT7 clock                  65  */ \
NULL,           /*!< DECFILT8 clock                  66  */ \
NULL,           /*!< DECFILT9 clock                  67  */ \
NULL,           /*!< DECFILT10 clock                 68  */ \
NULL,           /*!< DECFILT11 clock                 69  */ \
NULL,           /*!< DSPI0 clock                     70  */ \
NULL,           /*!< DSPI1 clock                     71  */ \
NULL,           /*!< DSPI2 clock                     72  */ \
NULL,           /*!< DSPI3 clock                     73  */ \
NULL,           /*!< DSPI4 clock                     74  */ \
NULL,           /*!< eSCI0 clock                     75  */ \
NULL,           /*!< eSCI1 clock                     76  */ \
NULL,           /*!< eSCI2 clock                     77  */ \
NULL,           /*!< eSCI3 clock                     78  */ \
NULL,           /*!< eSCI4 clock                     79  */ \
NULL,           /*!< eSCI5 clock                     80  */ \
NULL,           /*!< eMIOS0 clock                    81  */ \
NULL,           /*!< eMIOS1 clock                    82  */ \
NULL,           /*!< EQADC0 clock                    83  */ \
NULL,           /*!< EQADC1 clock                    84  */ \
NULL,           /*!< PIT0 clock                      85  */ \
NULL,           /*!< SENT0 clock                     86  */ \
NULL,           /*!< SENT1 clock                     87  */ \
NULL,           /*!< End of PER clocks               88  */ \
NULL,           /*!< LFAST0 clock                    89  */ \
NULL,           /*!< End of LFAST clocks             90  */ \
NULL,           /*!< MCAN0 clock                     91  */ \
NULL,           /*!< MCAN1 clock                     92  */ \
NULL,           /*!< End of CAN clocks               93  */ \
NULL,           /*!< PITRTI0 clock                   94  */ \
NULL,           /*!< End of XOSC_CLK clocks          95  */ \
NULL,           /*!< CSE0 clock                      96  */ \
NULL,           /*!< CRC0 clock                      97  */ \
NULL,           /*!< EBI0 clock                      98  */ \
NULL,           /*!< NPC0 clock                      99  */ \
NULL,           /*!< STCU0 clock                     100 */ \
NULL,           /*!< DMA0 clock                      101 */ \
NULL,           /*!< DMA1 clock                      102 */ \
NULL,           /*!< FLEXCAN0 clock                  103 */ \
NULL,           /*!< FLEXCAN1 clock                  104 */ \
NULL,           /*!< FLEXCAN2 clock                  105 */ \
NULL,           /*!< FLEXCAN3 clock                  106 */ \
NULL,           /*!< END_OF_PERIPHERAL_CLK_SOURCES   107 */ \
}



