ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/*! @brief interface clocks
  *  Mappings between clock names and interface clocks.
  *  If no interface clock exists for a given clock name,
  *  then the corresponding value is CLOCK_NAME_COUNT.
  */
#define  INTERFACE_CLOCKS \
{                                                                            \
CLOCK_NAME_COUNT,                /*!< IRCOSC_CLK clock                0   */ \
CLOCK_NAME_COUNT,                /*!< XOSC_CLK clock                  1   */ \
CLOCK_NAME_COUNT,                /*!< PLL0_PHI0_CLK clock             2   */ \
CLOCK_NAME_COUNT,                /*!< PLL0_PHI1_CLK clock             3   */ \
CLOCK_NAME_COUNT,                /*!< PLL1_PHI0_CLK clock             4   */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 5   */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 6   */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 7   */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 8   */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 9   */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 10  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 11  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 12  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 13  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 14  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 15  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 16  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 17  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 18  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 19  */ \
CLOCK_NAME_COUNT,                /*!< END_OF_CLK_SOURCES              20  */ \
CLOCK_NAME_COUNT,                /*!< SCS_CLK clock                   21  */ \
CLOCK_NAME_COUNT,                /*!< SYS_CLK clock                   22  */ \
CLOCK_NAME_COUNT,                /*!< PLAT_CLK clock                  23  */ \
CLOCK_NAME_COUNT,                /*!< PBRIDGEx_CLK clock              24  */ \
CLOCK_NAME_COUNT,                /*!< PER_CLK_SEL_CLK clock           25  */ \
CLOCK_NAME_COUNT,                /*!< PER_CLK clock                   26  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 27  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 28  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 29  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 30  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 31  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 32  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 33  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 34  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 35  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 36  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 37  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 38  */ \
CLOCK_NAME_COUNT,                /*!< No clock entry in clock_names_t 39  */ \
CLOCK_NAME_COUNT,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
CLOCK_NAME_COUNT,                /*!< End of SCS clocks               41  */ \
CLOCK_NAME_COUNT,                /*!< End of CORE clocks              42  */ \
PBRIDGEx_CLK,                    /*!< SIPI0 clock                     43  */ \
CLOCK_NAME_COUNT,                /*!< End of PLAT clocks              44  */ \
PBRIDGEx_CLK,                    /*!< FEC0 clock                      45  */ \
CLOCK_NAME_COUNT,                /*!< End of PBRIDGEx clocks          46  */ \
PER_CLK,                         /*!< ADCSD1 clock                    47  */ \
PER_CLK,                         /*!< ADCSD2 clock                    48  */ \
PER_CLK,                         /*!< ADCSD3 clock                    49  */ \
PER_CLK,                         /*!< ADCSD4 clock                    50  */ \
PER_CLK,                         /*!< ETPU0 clock                     51  */ \
PER_CLK,                         /*!< ETPU1 clock                     52  */ \
PBRIDGEx_CLK,                    /*!< PSI5RX0 clock                   53  */ \
PBRIDGEx_CLK,                    /*!< PSI5RX1 clock                   54  */ \
PBRIDGEx_CLK,                    /*!< PSI51us0 clock                  55  */ \
PBRIDGEx_CLK,                    /*!< PSI51us1 clock                  56  */ \
CLOCK_NAME_COUNT,                /*!< End of PER_CLK_SEL clocks       57  */ \
PER_CLK,                         /*!< DECFILT0 clock                  58  */ \
PER_CLK,                         /*!< DECFILT1 clock                  59  */ \
PER_CLK,                         /*!< DECFILT2 clock                  60  */ \
PER_CLK,                         /*!< DECFILT3 clock                  61  */ \
PER_CLK,                         /*!< DECFILT4 clock                  62  */ \
PER_CLK,                         /*!< DECFILT5 clock                  63  */ \
PER_CLK,                         /*!< DECFILT6 clock                  64  */ \
PER_CLK,                         /*!< DECFILT7 clock                  65  */ \
PER_CLK,                         /*!< DECFILT8 clock                  66  */ \
PER_CLK,                         /*!< DECFILT9 clock                  67  */ \
PER_CLK,                         /*!< DECFILT10 clock                 68  */ \
PER_CLK,                         /*!< DECFILT11 clock                 69  */ \
PER_CLK,                         /*!< DSPI0 clock                     70  */ \
PER_CLK,                         /*!< DSPI1 clock                     71  */ \
PER_CLK,                         /*!< DSPI2 clock                     72  */ \
PER_CLK,                         /*!< DSPI3 clock                     73  */ \
PER_CLK,                         /*!< DSPI4 clock                     74  */ \
PER_CLK,                         /*!< eSCI0 clock                     75  */ \
PER_CLK,                         /*!< eSCI1 clock                     76  */ \
PER_CLK,                         /*!< eSCI2 clock                     77  */ \
PER_CLK,                         /*!< eSCI3 clock                     78  */ \
PER_CLK,                         /*!< eSCI4 clock                     79  */ \
PER_CLK,                         /*!< eSCI5 clock                     80  */ \
PER_CLK,                         /*!< eMIOS0 clock                    81  */ \
PER_CLK,                         /*!< eMIOS1 clock                    82  */ \
PER_CLK,                         /*!< EQADC0 clock                    83  */ \
PER_CLK,                         /*!< EQADC1 clock                    84  */ \
PER_CLK,                         /*!< PIT0 clock                      85  */ \
PBRIDGEx_CLK,                    /*!< SENT0 clock                     86  */ \
PBRIDGEx_CLK,                    /*!< SENT1 clock                     87  */ \
CLOCK_NAME_COUNT,                /*!< End of PER clocks               88  */ \
PBRIDGEx_CLK,                    /*!< LFAST0 clock                    89  */ \
CLOCK_NAME_COUNT,                /*!< End of LFAST clocks             90  */ \
PBRIDGEx_CLK,                    /*!< MCAN0 clock                     91  */ \
PBRIDGEx_CLK,                    /*!< MCAN1 clock                     92  */ \
CLOCK_NAME_COUNT,                /*!< End of CAN clocks               93  */ \
PER_CLK,                         /*!< PITRTI0 clock                   94  */ \
CLOCK_NAME_COUNT,                /*!< End of XOSC_CLK clocks          95  */ \
PBRIDGEx_CLK,                    /*!< CSE0 clock                      96  */ \
PBRIDGEx_CLK,                    /*!< CRC0 clock                      97  */ \
PBRIDGEx_CLK,                    /*!< EBI0 clock                      98  */ \
PBRIDGEx_CLK,                    /*!< NPC0 clock                      99  */ \
PBRIDGEx_CLK,                    /*!< STCU0 clock                     100 */ \
PBRIDGEx_CLK,                    /*!< DMA0 clock                      101 */ \
PBRIDGEx_CLK,                    /*!< DMA1 clock                      102 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN0 clock                  103 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN1 clock                  104 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN2 clock                  105 */ \
PBRIDGEx_CLK,                    /*!< FLEXCAN3 clock                  106 */ \
CLOCK_NAME_COUNT                 /*!< END_OF_PERIPHERAL_CLK_SOURCES   107 */ \
}



/*! @brief Halt clocks
 *  Mappings between clock names and the SIU registers.
 *  If no clock maskset exists for a given clock name,
 *  then the corresponding value is 0, else the value
 *  is 1.
 */
#define SIU_CLOCKS \
{                                                              \
0U,                /*!< IRCOSC_CLK clock                0   */ \
0U,                /*!< XOSC_CLK clock                  1   */ \
0U,                /*!< PLL0_PHI0_CLK clock             2   */ \
0U,                /*!< PLL0_PHI1_CLK clock             3   */ \
0U,                /*!< PLL1_PHI0_CLK clock             4   */ \
0U,                /*!< No clock entry in clock_names_t 5   */ \
0U,                /*!< No clock entry in clock_names_t 6   */ \
0U,                /*!< No clock entry in clock_names_t 7   */ \
0U,                /*!< No clock entry in clock_names_t 8   */ \
0U,                /*!< No clock entry in clock_names_t 9   */ \
0U,                /*!< No clock entry in clock_names_t 10  */ \
0U,                /*!< No clock entry in clock_names_t 11  */ \
0U,                /*!< No clock entry in clock_names_t 12  */ \
0U,                /*!< No clock entry in clock_names_t 13  */ \
0U,                /*!< No clock entry in clock_names_t 14  */ \
0U,                /*!< No clock entry in clock_names_t 15  */ \
0U,                /*!< No clock entry in clock_names_t 16  */ \
0U,                /*!< No clock entry in clock_names_t 17  */ \
0U,                /*!< No clock entry in clock_names_t 18  */ \
0U,                /*!< No clock entry in clock_names_t 19  */ \
0U,                /*!< END_OF_CLK_SOURCES              20  */ \
0U,                /*!< SCS_CLK clock                   21  */ \
0U,                /*!< SYS_CLK clock                   22  */ \
0U,                /*!< PLAT_CLK clock                  23  */ \
0U,                /*!< PBRIDGEx_CLK clock              24  */ \
0U,                /*!< PER_CLK_SEL_CLK clock           25  */ \
0U,                /*!< PER_CLK clock                   26  */ \
0U,                /*!< No clock entry in clock_names_t 27  */ \
0U,                /*!< No clock entry in clock_names_t 28  */ \
0U,                /*!< No clock entry in clock_names_t 29  */ \
0U,                /*!< No clock entry in clock_names_t 30  */ \
0U,                /*!< No clock entry in clock_names_t 31  */ \
0U,                /*!< No clock entry in clock_names_t 32  */ \
0U,                /*!< No clock entry in clock_names_t 33  */ \
0U,                /*!< No clock entry in clock_names_t 34  */ \
0U,                /*!< No clock entry in clock_names_t 35  */ \
0U,                /*!< No clock entry in clock_names_t 36  */ \
0U,                /*!< No clock entry in clock_names_t 37  */ \
0U,                /*!< No clock entry in clock_names_t 38  */ \
0U,                /*!< No clock entry in clock_names_t 39  */ \
0U,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
0U,                /*!< End of SCS clocks               41  */ \
0U,                /*!< End of CORE clocks              42  */ \
1U,                /*!< SIPI0 clock                     43  */ \
0U,                /*!< End of PLAT clocks              44  */ \
1U,                /*!< FEC0 clock                      45  */ \
0U,                /*!< End of PBRIDGEx clocks          46  */ \
1U,                /*!< ADCSD1 clock                    47  */ \
1U,                /*!< ADCSD2 clock                    48  */ \
1U,                /*!< ADCSD3 clock                    49  */ \
1U,                /*!< ADCSD4 clock                    50  */ \
1U,                /*!< ETPU0 clock                     51  */ \
1U,                /*!< ETPU1 clock                     52  */ \
1U,                /*!< PSI5RX0 clock                   53  */ \
1U,                /*!< PSI5RX1 clock                   54  */ \
1U,                /*!< PSI51us0 clock                  55  */ \
1U,                /*!< PSI51us1 clock                  56  */ \
0U,                /*!< End of PER_CLK_SEL clocks       57  */ \
1U,                /*!< DECFILT0 clock                  58  */ \
1U,                /*!< DECFILT1 clock                  59  */ \
1U,                /*!< DECFILT2 clock                  60  */ \
1U,                /*!< DECFILT3 clock                  61  */ \
1U,                /*!< DECFILT4 clock                  62  */ \
1U,                /*!< DECFILT5 clock                  63  */ \
1U,                /*!< DECFILT6 clock                  64  */ \
1U,                /*!< DECFILT7 clock                  65  */ \
1U,                /*!< DECFILT8 clock                  66  */ \
1U,                /*!< DECFILT9 clock                  67  */ \
1U,                /*!< DECFILT10 clock                 68  */ \
1U,                /*!< DECFILT11 clock                 69  */ \
1U,                /*!< DSPI0 clock                     70  */ \
1U,                /*!< DSPI1 clock                     71  */ \
1U,                /*!< DSPI2 clock                     72  */ \
1U,                /*!< DSPI3 clock                     73  */ \
1U,                /*!< DSPI4 clock                     74  */ \
1U,                /*!< eSCI0 clock                     75  */ \
1U,                /*!< eSCI1 clock                     76  */ \
1U,                /*!< eSCI2 clock                     77  */ \
1U,                /*!< eSCI3 clock                     78  */ \
1U,                /*!< eSCI4 clock                     79  */ \
1U,                /*!< eSCI5 clock                     80  */ \
1U,                /*!< eMIOS0 clock                    81  */ \
1U,                /*!< eMIOS1 clock                    82  */ \
1U,                /*!< EQADC0 clock                    83  */ \
1U,                /*!< EQADC1 clock                    84  */ \
1U,                /*!< PIT0 clock                      85  */ \
1U,                /*!< SENT0 clock                     86  */ \
1U,                /*!< SENT1 clock                     87  */ \
0U,                /*!< End of PER clocks               88  */ \
1U,                /*!< LFAST0 clock                    89  */ \
0U,                /*!< End of LFAST clocks             90  */ \
1U,                /*!< MCAN0 clock                     91  */ \
1U,                /*!< MCAN1 clock                     92  */ \
0U,                /*!< End of CAN clocks               93  */ \
1U,                /*!< PITRTI0 clock                   94  */ \
0U,                /*!< End of XOSC_CLK clocks          95  */ \
1U,                /*!< CSE0 clock                      96  */ \
1U,                /*!< CRC0 clock                      97  */ \
1U,                /*!< EBI0 clock                      98  */ \
1U,                /*!< NPC0 clock                      99  */ \
1U,                /*!< STCU0 clock                     100 */ \
1U,                /*!< DMA0 clock                      101 */ \
1U,                /*!< DMA1 clock                      102 */ \
1U,                /*!< FLEXCAN0 clock                  103 */ \
1U,                /*!< FLEXCAN1 clock                  104 */ \
1U,                /*!< FLEXCAN2 clock                  105 */ \
1U,                /*!< FLEXCAN3 clock                  106 */ \
0U                 /*!< END_OF_PERIPHERAL_CLK_SOURCES   107 */ \
}

/*! @brief Halt masksets
 *  Mappings between clock names and masksets.
 *  If no clock maskset exists for a given clock name,
 *  then the corresponding value is 0. Values 1 or 2 represent
 *  the corresponding halt register.
 */
#define MASKSET_CLOCKS \
{                                                              \
0U,                /*!< IRCOSC_CLK clock                0   */ \
0U,                /*!< XOSC_CLK clock                  1   */ \
0U,                /*!< PLL0_PHI0_CLK clock             2   */ \
0U,                /*!< PLL0_PHI1_CLK clock             3   */ \
0U,                /*!< PLL1_PHI0_CLK clock             4   */ \
0U,                /*!< No clock entry in clock_names_t 5   */ \
0U,                /*!< No clock entry in clock_names_t 6   */ \
0U,                /*!< No clock entry in clock_names_t 7   */ \
0U,                /*!< No clock entry in clock_names_t 8   */ \
0U,                /*!< No clock entry in clock_names_t 9   */ \
0U,                /*!< No clock entry in clock_names_t 10  */ \
0U,                /*!< No clock entry in clock_names_t 11  */ \
0U,                /*!< No clock entry in clock_names_t 12  */ \
0U,                /*!< No clock entry in clock_names_t 13  */ \
0U,                /*!< No clock entry in clock_names_t 14  */ \
0U,                /*!< No clock entry in clock_names_t 15  */ \
0U,                /*!< No clock entry in clock_names_t 16  */ \
0U,                /*!< No clock entry in clock_names_t 17  */ \
0U,                /*!< No clock entry in clock_names_t 18  */ \
0U,                /*!< No clock entry in clock_names_t 19  */ \
0U,                /*!< END_OF_CLK_SOURCES              20  */ \
0U,                /*!< SCS_CLK clock                   21  */ \
0U,                /*!< SYS_CLK clock                   22  */ \
0U,                /*!< PLAT_CLK clock                  23  */ \
0U,                /*!< PBRIDGEx_CLK clock              24  */ \
0U,                /*!< PER_CLK_SEL_CLK clock           25  */ \
0U,                /*!< PER_CLK clock                   26  */ \
0U,                /*!< No clock entry in clock_names_t 27  */ \
0U,                /*!< No clock entry in clock_names_t 28  */ \
0U,                /*!< No clock entry in clock_names_t 29  */ \
0U,                /*!< No clock entry in clock_names_t 30  */ \
0U,                /*!< No clock entry in clock_names_t 31  */ \
0U,                /*!< No clock entry in clock_names_t 32  */ \
0U,                /*!< No clock entry in clock_names_t 33  */ \
0U,                /*!< No clock entry in clock_names_t 34  */ \
0U,                /*!< No clock entry in clock_names_t 35  */ \
0U,                /*!< No clock entry in clock_names_t 36  */ \
0U,                /*!< No clock entry in clock_names_t 37  */ \
0U,                /*!< No clock entry in clock_names_t 38  */ \
0U,                /*!< No clock entry in clock_names_t 39  */ \
0U,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
0U,                /*!< End of SCS clocks               41  */ \
0U,                /*!< End of CORE clocks              42  */ \
2U,                /*!< SIPI0 clock                     43  */ \
0U,                /*!< End of PLAT clocks              44  */ \
2U,                /*!< FEC0 clock                      45  */ \
0U,                /*!< End of PBRIDGEx clocks          46  */ \
2U,                /*!< ADCSD1 clock                    47  */ \
2U,                /*!< ADCSD2 clock                    48  */ \
2U,                /*!< ADCSD3 clock                    49  */ \
2U,                /*!< ADCSD4 clock                    50  */ \
1U,                /*!< ETPU0 clock                     51  */ \
1U,                /*!< ETPU1 clock                     52  */ \
2U,                /*!< PSI5RX0 clock                   53  */ \
2U,                /*!< PSI5RX1 clock                   54  */ \
2U,                /*!< PSI51us0 clock                  55  */ \
2U,                /*!< PSI51us1 clock                  56  */ \
0U,                /*!< End of PER_CLK_SEL clocks       57  */ \
1U,                /*!< DECFILT0 clock                  58  */ \
1U,                /*!< DECFILT1 clock                  59  */ \
1U,                /*!< DECFILT2 clock                  60  */ \
1U,                /*!< DECFILT3 clock                  61  */ \
1U,                /*!< DECFILT4 clock                  62  */ \
1U,                /*!< DECFILT5 clock                  63  */ \
1U,                /*!< DECFILT6 clock                  64  */ \
1U,                /*!< DECFILT7 clock                  65  */ \
1U,                /*!< DECFILT8 clock                  66  */ \
1U,                /*!< DECFILT9 clock                  67  */ \
1U,                /*!< DECFILT10 clock                 68  */ \
1U,                /*!< DECFILT11 clock                 69  */ \
1U,                /*!< DSPI0 clock                     70  */ \
1U,                /*!< DSPI1 clock                     71  */ \
1U,                /*!< DSPI2 clock                     72  */ \
1U,                /*!< DSPI3 clock                     73  */ \
1U,                /*!< DSPI4 clock                     74  */ \
1U,                /*!< eSCI0 clock                     75  */ \
1U,                /*!< eSCI1 clock                     76  */ \
1U,                /*!< eSCI2 clock                     77  */ \
1U,                /*!< eSCI3 clock                     78  */ \
1U,                /*!< eSCI4 clock                     79  */ \
1U,                /*!< eSCI5 clock                     80  */ \
1U,                /*!< eMIOS0 clock                    81  */ \
1U,                /*!< eMIOS1 clock                    82  */ \
1U,                /*!< EQADC0 clock                    83  */ \
1U,                /*!< EQADC1 clock                    84  */ \
1U,                /*!< PIT0 clock                      85  */ \
2U,                /*!< SENT0 clock                     86  */ \
2U,                /*!< SENT1 clock                     87  */ \
0U,                /*!< End of PER clocks               88  */ \
2U,                /*!< LFAST0 clock                    89  */ \
0U,                /*!< End of LFAST clocks             90  */ \
2U,                /*!< MCAN0 clock                     91  */ \
2U,                /*!< MCAN1 clock                     92  */ \
0U,                /*!< End of CAN clocks               93  */ \
1U,                /*!< PITRTI0 clock                   94  */ \
0U,                /*!< End of XOSC_CLK clocks          95  */ \
1U,                /*!< CSE0 clock                      96  */ \
2U,                /*!< CRC0 clock                      97  */ \
1U,                /*!< EBI0 clock                      98  */ \
1U,                /*!< NPC0 clock                      99  */ \
2U,                /*!< STCU0 clock                     100 */ \
0U,                /*!< DMA0 clock                      101 */ \
0U,                /*!< DMA1 clock                      102 */ \
1U,                /*!< FLEXCAN0 clock                  103 */ \
1U,                /*!< FLEXCAN1 clock                  104 */ \
1U,                /*!< FLEXCAN2 clock                  105 */ \
1U,                /*!< FLEXCAN3 clock                  106 */ \
0U                 /*!< END_OF_PERIPHERAL_CLK_SOURCES   107 */ \
}

