ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/*! @brief Halt bitfields
 *  Mappings between clock names and the corresponding bitfield
 *  in the halt register.
 */
#define BITFIELD_CLOCKS \
{                                                              \
0U,                /*!< IRCOSC_CLK clock                0   */ \
0U,                /*!< XOSC_CLK clock                  1   */ \
0U,                /*!< PLL0_PHI0_CLK clock             2   */ \
0U,                /*!< PLL0_PHI1_CLK clock             3   */ \
0U,                /*!< PLL1_PHI0_CLK clock             4   */ \
0U,                /*!< No clock entry in clock_names_t 5   */ \
0U,                /*!< No clock entry in clock_names_t 6   */ \
0U,                /*!< No clock entry in clock_names_t 7   */ \
0U,                /*!< No clock entry in clock_names_t 8   */ \
0U,                /*!< No clock entry in clock_names_t 9   */ \
0U,                /*!< No clock entry in clock_names_t 10  */ \
0U,                /*!< No clock entry in clock_names_t 11  */ \
0U,                /*!< No clock entry in clock_names_t 12  */ \
0U,                /*!< No clock entry in clock_names_t 13  */ \
0U,                /*!< No clock entry in clock_names_t 14  */ \
0U,                /*!< No clock entry in clock_names_t 15  */ \
0U,                /*!< No clock entry in clock_names_t 16  */ \
0U,                /*!< No clock entry in clock_names_t 17  */ \
0U,                /*!< No clock entry in clock_names_t 18  */ \
0U,                /*!< No clock entry in clock_names_t 19  */ \
0U,                /*!< END_OF_CLK_SOURCES              20  */ \
0U,                /*!< SCS_CLK clock                   21  */ \
0U,                /*!< SYS_CLK clock                   22  */ \
0U,                /*!< PLAT_CLK clock                  23  */ \
0U,                /*!< PBRIDGEx_CLK clock              24  */ \
0U,                /*!< PER_CLK_SEL_CLK clock           25  */ \
0U,                /*!< PER_CLK clock                   26  */ \
0U,                /*!< No clock entry in clock_names_t 27  */ \
0U,                /*!< No clock entry in clock_names_t 28  */ \
0U,                /*!< No clock entry in clock_names_t 29  */ \
0U,                /*!< No clock entry in clock_names_t 30  */ \
0U,                /*!< No clock entry in clock_names_t 31  */ \
0U,                /*!< No clock entry in clock_names_t 32  */ \
0U,                /*!< No clock entry in clock_names_t 33  */ \
0U,                /*!< No clock entry in clock_names_t 34  */ \
0U,                /*!< No clock entry in clock_names_t 35  */ \
0U,                /*!< No clock entry in clock_names_t 36  */ \
0U,                /*!< No clock entry in clock_names_t 37  */ \
0U,                /*!< No clock entry in clock_names_t 38  */ \
0U,                /*!< No clock entry in clock_names_t 39  */ \
0U,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
0U,                /*!< End of SCS clocks               41  */ \
0U,                /*!< End of CORE clocks              42  */ \
16U,               /*!< SIPI0 clock                     43  */ \
0U,                /*!< End of PLAT clocks              44  */ \
0U,                /*!< FEC0 clock                      45  */ \
0U,                /*!< End of PBRIDGEx clocks          46  */ \
15U,               /*!< ADCSD1 clock                    47  */ \
14U,               /*!< ADCSD2 clock                    48  */ \
13U,               /*!< ADCSD3 clock                    49  */ \
12U,               /*!< ADCSD4 clock                    50  */ \
5U,                /*!< ETPU0 clock                     51  */ \
4U,                /*!< ETPU1 clock                     52  */ \
27U,               /*!< PSI5RX0 clock                   53  */ \
26U,               /*!< PSI5RX1 clock                   54  */ \
27U,               /*!< PSI51us0 clock                  55  */ \
26U,               /*!< PSI51us1 clock                  56  */ \
0U,                /*!< End of PER_CLK_SEL clocks       57  */ \
11U,               /*!< DECFILT0 clock                  58  */ \
11U,               /*!< DECFILT1 clock                  59  */ \
11U,               /*!< DECFILT2 clock                  60  */ \
11U,               /*!< DECFILT3 clock                  61  */ \
11U,               /*!< DECFILT4 clock                  62  */ \
11U,               /*!< DECFILT5 clock                  63  */ \
11U,               /*!< DECFILT6 clock                  64  */ \
11U,               /*!< DECFILT7 clock                  65  */ \
11U,               /*!< DECFILT8 clock                  66  */ \
11U,               /*!< DECFILT9 clock                  67  */ \
11U,               /*!< DECFILT10 clock                 68  */ \
11U,               /*!< DECFILT11 clock                 69  */ \
23U,               /*!< DSPI0 clock                     70  */ \
22U,               /*!< DSPI1 clock                     71  */ \
21U,               /*!< DSPI2 clock                     72  */ \
20U,               /*!< DSPI3 clock                     73  */ \
24U,               /*!< DSPI4 clock                     74  */ \
31U,               /*!< eSCI0 clock                     75  */ \
30U,               /*!< eSCI1 clock                     76  */ \
29U,               /*!< eSCI2 clock                     77  */ \
28U,               /*!< eSCI3 clock                     78  */ \
27U,               /*!< eSCI4 clock                     79  */ \
26U,               /*!< eSCI5 clock                     80  */ \
10U,               /*!< eMIOS0 clock                    81  */ \
12U,               /*!< eMIOS1 clock                    82  */ \
9U,                /*!< EQADC0 clock                    83  */ \
8U,                /*!< EQADC1 clock                    84  */ \
13U,               /*!< PIT0 clock                      85  */ \
23U,               /*!< SENT0 clock                     86  */ \
22U,               /*!< SENT1 clock                     87  */ \
0U,                /*!< End of PER clocks               88  */ \
16U,               /*!< LFAST0 clock                    89  */ \
0U,                /*!< End of LFAST clocks             90  */ \
31U,               /*!< MCAN0 clock                     91  */ \
30U,               /*!< MCAN1 clock                     92  */ \
0U,                /*!< End of CAN clocks               93  */ \
13U,               /*!< PITRTI0 clock                   94  */ \
0U,                /*!< End of XOSC_CLK clocks          95  */ \
3U,                /*!< CSE0 clock                      96  */ \
17U,               /*!< CRC0 clock                      97  */ \
7U,                /*!< EBI0 clock                      98  */ \
6U,                /*!< NPC0 clock                      99  */ \
18U,               /*!< STCU0 clock                     100 */ \
0U,      		   /*!< DMA0 clock                      101 */ \
0U,                /*!< DMA1 clock                      102 */ \
19U,               /*!< FLEXCAN0 clock                  103 */ \
18U,               /*!< FLEXCAN1 clock                  104 */ \
17U,               /*!< FLEXCAN2 clock                  105 */ \
16U,               /*!< FLEXCAN3 clock                  106 */ \
0U                 /*!< END_OF_PERIPHERAL_CLK_SOURCES   107 */ \
}

/*! @brief Halt masksets
 *  Mappings between clock names and masksets.
 *  If no clock maskset exists for a given clock name,
 *  then the corresponding value is 0. Values 1 or 2 represent
 *  the corresponding halt register.
 */
#define MASK_CLOCKS \
{                                                              \
0x0u,                /*!< IRCOSC_CLK clock                0   */ \
0x0u,                /*!< XOSC_CLK clock                  1   */ \
0x0u,                /*!< PLL0_PHI0_CLK clock             2   */ \
0x0u,                /*!< PLL0_PHI1_CLK clock             3   */ \
0x0u,                /*!< PLL1_PHI0_CLK clock             4   */ \
0x0u,                /*!< No clock entry in clock_names_t 5   */ \
0x0u,                /*!< No clock entry in clock_names_t 6   */ \
0x0u,                /*!< No clock entry in clock_names_t 7   */ \
0x0u,                /*!< No clock entry in clock_names_t 8   */ \
0x0u,                /*!< No clock entry in clock_names_t 9   */ \
0x0u,                /*!< No clock entry in clock_names_t 10  */ \
0x0u,                /*!< No clock entry in clock_names_t 11  */ \
0x0u,                /*!< No clock entry in clock_names_t 12  */ \
0x0u,                /*!< No clock entry in clock_names_t 13  */ \
0x0u,                /*!< No clock entry in clock_names_t 14  */ \
0x0u,                /*!< No clock entry in clock_names_t 15  */ \
0x0u,                /*!< No clock entry in clock_names_t 16  */ \
0x0u,                /*!< No clock entry in clock_names_t 17  */ \
0x0u,                /*!< No clock entry in clock_names_t 18  */ \
0x0u,                /*!< No clock entry in clock_names_t 19  */ \
0x0u,                /*!< END_OF_CLK_SOURCES              20  */ \
0x0u,                /*!< SCS_CLK clock                   21  */ \
0x0u,                /*!< SYS_CLK clock                   22  */ \
0x0u,                /*!< PLAT_CLK clock                  23  */ \
0x0u,                /*!< PBRIDGEx_CLK clock              24  */ \
0x0u,                /*!< PER_CLK_SEL_CLK clock           25  */ \
0x0u,                /*!< PER_CLK clock                   26  */ \
0x0u,                /*!< No clock entry in clock_names_t 27  */ \
0x0u,                /*!< No clock entry in clock_names_t 28  */ \
0x0u,                /*!< No clock entry in clock_names_t 29  */ \
0x0u,                /*!< No clock entry in clock_names_t 30  */ \
0x0u,                /*!< No clock entry in clock_names_t 31  */ \
0x0u,                /*!< No clock entry in clock_names_t 32  */ \
0x0u,                /*!< No clock entry in clock_names_t 33  */ \
0x0u,                /*!< No clock entry in clock_names_t 34  */ \
0x0u,                /*!< No clock entry in clock_names_t 35  */ \
0x0u,                /*!< No clock entry in clock_names_t 36  */ \
0x0u,                /*!< No clock entry in clock_names_t 37  */ \
0x0u,                /*!< No clock entry in clock_names_t 38  */ \
0x0u,                /*!< No clock entry in clock_names_t 39  */ \
0x0u,                /*!< END_OF_SYSTEM_CLOCKS            40  */ \
0x0u,                /*!< End of SCS clocks               41  */ \
0x0u,                /*!< End of CORE clocks              42  */ \
0x8000u,             /*!< SIPI0 clock                     43  */ \
0x0u,                /*!< End of PLAT clocks              44  */ \
0x80000000u,         /*!< FEC0 clock                      45  */ \
0x0u,                /*!< End of PBRIDGEx clocks          46  */ \
0x10000u,            /*!< ADCSD1 clock                    47  */ \
0x20000u,            /*!< ADCSD2 clock                    48  */ \
0x40000u,            /*!< ADCSD3 clock                    49  */ \
0x80000u,            /*!< ADCSD4 clock                    50  */ \
0x4000000u,          /*!< ETPU0 clock                     51  */ \
0x8000000u,          /*!< ETPU1 clock                     52  */ \
0x10u,               /*!< PSI5RX0 clock                   53  */ \
0x20u,               /*!< PSI5RX1 clock                   54  */ \
0x10u,                /*!< PSI51us0 clock                  55  */ \
0x20u,                /*!< PSI51us1 clock                  56  */ \
0x0u,                /*!< End of PER_CLK_SEL clocks       57  */ \
0x100000u,           /*!< DECFILT0 clock                  58  */ \
0x100000u,           /*!< DECFILT1 clock                  59  */ \
0x100000u,           /*!< DECFILT2 clock                  60  */ \
0x100000u,           /*!< DECFILT3 clock                  61  */ \
0x100000u,           /*!< DECFILT4 clock                  62  */ \
0x100000u,           /*!< DECFILT5 clock                  63  */ \
0x100000u,           /*!< DECFILT6 clock                  64  */ \
0x100000u,           /*!< DECFILT7 clock                  65  */ \
0x100000u,           /*!< DECFILT8 clock                  66  */ \
0x100000u,           /*!< DECFILT9 clock                  67  */ \
0x100000u,           /*!< DECFILT10 clock                 68  */ \
0x100000u,           /*!< DECFILT11 clock                 69  */ \
0x100u,              /*!< DSPI0 clock                     70  */ \
0x200u,              /*!< DSPI1 clock                     71  */ \
0x400u,              /*!< DSPI2 clock                     72  */ \
0x800u,              /*!< DSPI3 clock                     73  */ \
0x80u,               /*!< DSPI4 clock                     74  */ \
0x1u,                /*!< eSCI0 clock                     75  */ \
0x2u,                /*!< eSCI1 clock                     76  */ \
0x4u,                /*!< eSCI2 clock                     77  */ \
0x8u,                /*!< eSCI3 clock                     78  */ \
0x10u,               /*!< eSCI4 clock                     79  */ \
0x20u,               /*!< eSCI5 clock                     80  */ \
0x200000u,           /*!< eMIOS0 clock                    81  */ \
0x80000u,            /*!< eMIOS1 clock                    82  */ \
0x400000u,           /*!< EQADC0 clock                    83  */ \
0x800000u,           /*!< EQADC1 clock                    84  */ \
0x40000u,            /*!< PIT0 clock                      85  */ \
0x100u,              /*!< SENT0 clock                     86  */ \
0x200u,              /*!< SENT1 clock                     87  */ \
0x0u,                /*!< End of PER clocks               88  */ \
0x8000u,             /*!< LFAST0 clock                    89  */ \
0x0u,                /*!< End of LFAST clocks             90  */ \
0x1u,                /*!< MCAN0 clock                     91  */ \
0x2u,                /*!< MCAN1 clock                     92  */ \
0x0u,                /*!< End of CAN clocks               93  */ \
0x40000u,            /*!< PITRTI0 clock                   94  */ \
0x0u,                /*!< End of XOSC_CLK clocks          95  */ \
0x10000000u,         /*!< CSE0 clock                      96  */ \
0x4000u,             /*!< CRC0 clock                      97  */ \
0x1000000u,          /*!< EBI0 clock                      98  */ \
0x2000000u,          /*!< NPC0 clock                      99  */ \
0x2000u,             /*!< STCU0 clock                     100 */ \
0x0u,                /*!< DMA0 clock                      101 */ \
0x0u,                /*!< DMA1 clock                      102 */ \
0x1000u,             /*!< FLEXCAN0 clock                  103 */ \
0x2000u,             /*!< FLEXCAN1 clock                  104 */ \
0x4000u,             /*!< FLEXCAN2 clock                  105 */ \
0x8000u,             /*!< FLEXCAN3 clock                  106 */ \
0x0u                 /*!< END_OF_PERIPHERAL_CLK_SOURCES   107 */ \
}

/* Interrupt module features */

/* @brief Lowest interrupt request number. */
#define FEATURE_INTERRUPT_IRQ_MIN         (SS0_IRQn)
/* @brief Highest interrupt request number. */
#define FEATURE_INTERRUPT_IRQ_MAX         (STCU_IRQn)
/* @brief Highest interrupt priority number. */
#define FEATURE_INTERRUPT_PRIO_MAX  (15u)
/* @brief Highest software interrupt request number. */
#define FEATURE_INTERRUPT_SOFTWARE_IRQ_MAX  (SS7_IRQn)
/* @brief Has software interrupt. */
#define FEATURE_INTERRUPT_HAS_SOFTWARE_IRQ  (1u)
/* @brief Has pending interrupt state. */
#define FEATURE_INTERRUPT_HAS_PENDING_STATE (0u)
/* @brief Has active interrupt state. */
#define FEATURE_INTERRUPT_HAS_ACTIVE_STATE  (0u)
/* @brief Default interrupt priority for enable interrupts. */
#define FEATURE_INTERRUPT_DEFAULT_PRIO  (1u)
/* @brief Multicore support for interrupts */
#define FEATURE_INTERRUPT_MULTICORE_SUPPORT  (1u)
/* @brief Mask to enable interrupts for all cores */
#define FEATURE_INTERRUPT_ENABLE_ON_ALL_CORES_MASK  (0xC000u)
/* @brief Available cores for this device */
#define FEATURE_INTERRUPT_CORE_0_ENABLED (1u)
#define FEATURE_INTERRUPT_CORE_1_ENABLED (1u)
#define FEATURE_INTERRUPT_CORE_2_ENABLED (0u)
/* @brief Registers in which the start of interrupt vector table needs to be configured */
#define FEATURE_INTERRUPT_INT_VECTORS {&INTC->IACKR0,&INTC->IACKR1}
/* Bitfield values for INTC_PSR_PRC_SELn */
#define INTC_PSR_PRC_CORE_0      0U
#define INTC_PSR_PRC_CORE_1      3U
#define INTC_PSR_PRC_BOTH_CORES  1U

