ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* eSCI Module features */
#define FEATURE_ESCI_IRQS           { ESCI0_CIR_IRQn, \
                                      ESCI1_CIR_IRQn, \
                                      ESCI2_CIR_IRQn, \
                                      ESCI3_CIR_IRQn, \
                                      ESCI4_CIR_IRQn, \
                                      ESCI5_CIR_IRQn }
#define FEATURE_ESCI_CLOCK_NAMES    { eSCI0_CLK, \
                                      eSCI1_CLK, \
                                      eSCI2_CLK, \
                                      eSCI3_CLK, \
                                      eSCI4_CLK, \
                                      eSCI5_CLK }
#define FEATURE_ESCI_DMA_SUPPORT    { true, true, false, \
                                      false, false, false }
#define FEATURE_ESCI_TX_DMA_CHANNEL { 18U, 34U }
#define FEATURE_ESCI_TX_DMA_CHANNEL_COUNT (2U)
#define FEATURE_ESCI_RX_DMA_CHANNEL { 19U, 35U }
#define FEATURE_ESCI_RX_DMA_CHANNEL_COUNT (2U)

/* FLASH C55 module features */

/* @brief Type of flash module is C55FMC. */
#define FEATURE_FLS_C55_C55FMC (1U)
/* @brief Type of flash module is C55MP. */
#define FEATURE_FLS_C55_C55MP (0U)
/* @brief Type of flash module is C55FP. */
#define FEATURE_FLS_C55_C55FP (0U)
/* @brief Over-program protection enabled block. */
#define FEATURE_FLS_C55_HAS_OTP
/* @brief Has alternate interface. */
#define FEATURE_FLS_C55_HAS_ALTERNATE (0U)
/* @brief Has erase operation in the alternate interface. */
#define FEATURE_FLS_C55_HAS_ERASE_ALTERNATE (0U)
/* @brief The size of writes that are allowed. */
#define FLASH_C55_PROGRAMABLE_SIZE (0x80U)
/* @brief The address in the uTest space. */
#define FLASH_C55_INTERLOCK_WRITE_UTEST_ADDRESS (0x00400000U)
/* @brief The base address of the 16KB high block. */
#define FLASH_C55_16KB_HIGH_BASE_ADDRESS (0x00600000U)
/* @brief The base address of the 32KB high block. */
#define FLASH_C55_32KB_HIGH_BASE_ADDRESS (0xFFFFFFFFU)
/* @brief The base address of the 64KB high block. */
#define FLASH_C55_64KB_HIGH_BASE_ADDRESS (0xFFFFFFFFU)
/* @brief The base address of the 16KB mid block. */
#define FLASH_C55_16KB_MID_BASE_ADDRESS (0xFFFFFFFFU)
/* @brief The base address of the 32KB mid block. */
#define FLASH_C55_32KB_MID_BASE_ADDRESS (0xFFFFFFFFU)
/* @brief The base address of the 64KB mid block. */
#define FLASH_C55_64KB_MID_BASE_ADDRESS (0x00020000U)
/* @brief The base address of the 16KB low block. */
#define FLASH_C55_16KB_LOW_BASE_ADDRESS (0xFFFFFFFFU)
/* @brief The base address of the 32KB low block. */
#define FLASH_C55_32KB_LOW_BASE_ADDRESS (0xFFFFFFFFU)
/* @brief The base address of the 64KB low block. */
#define FLASH_C55_64KB_LOW_BASE_ADDRESS (0x00000000U)
/* @brief The size of 16K block. */
#define FLASH_C55_16KB_SIZE (0x4000U)
/* @brief The size of 32K block. */
#define FLASH_C55_32KB_SIZE (0x8000U)
/* @brief The size of 64K block. */
#define FLASH_C55_64KB_SIZE (0x10000U)
/* @brief The base address of the 256KB block. */
#define FLASH_C55_256KB_BASE_ADDRESS (0x00800000U)

#define NUM_LOW_BLOCK                          2U
/* @brief The number of 16K low block */
#define NUM_16K_LOW_BLOCK                      0U
/* @brief The number of 32K low block */
#define NUM_32K_LOW_BLOCK                      0U
/* @brief The number of 64K low block */
#define NUM_64K_LOW_BLOCK                      2U
/* @brief The number of mid block */
#define NUM_MID_BLOCK                          2U
/* @brief The number of high block */
#define NUM_HIGH_BLOCK                         2U
/* @brief The number of 256k block */
#define NUM_256K_BLOCK_FIRST                   32U
#define NUM_256K_BLOCK_SECOND                  0U
#define NUM_256K_BLOCK                         (NUM_256K_BLOCK_FIRST + NUM_256K_BLOCK_SECOND)
#define NUM_BLOCK                              (NUM_LOW_BLOCK + NUM_MID_BLOCK + NUM_HIGH_BLOCK + NUM_256K_BLOCK)

#define LOW_BLOCK0_ADDR                        0x00000000U
#define LOW_BLOCK0_MASK                        (1UL << 0x0U)

#define LOW_BLOCK1_ADDR                        0x00010000U
#define LOW_BLOCK1_MASK                        (1UL << 0x1U)

/* Define Macros for mid blocks */
#define MID_BLOCK0_ADDR                        0x00020000U
#define MID_BLOCK0_MASK                        (1UL << 0x0U)

#define MID_BLOCK1_ADDR                        0x00030000U
#define MID_BLOCK1_MASK                        (1UL << 0x1U)

/* Define Macros for high blocks */
#define HIGH_BLOCK0_ADDR                        0x00060000U
#define HIGH_BLOCK0_MASK                        (1UL << 0x0U)

#define HIGH_BLOCK1_ADDR                        0x00604000U
#define HIGH_BLOCK1_MASK                        (1UL << 0x1U)

/* Define Macros for 256k blocks */
#define N256K_BLOCK0_ADDR                       0x00800000U
#define N256K_BLOCK0_MASK                       (1UL << 0x0U)

#define N256K_BLOCK1_ADDR                       0x00840000U
#define N256K_BLOCK1_MASK                       (1UL << 0x1U)

#define N256K_BLOCK2_ADDR                       0x00880000U
#define N256K_BLOCK2_MASK                       (1UL << 0x2U)

#define N256K_BLOCK3_ADDR                       0x008C0000U
#define N256K_BLOCK3_MASK                       (1UL << 0x3U)

#define N256K_BLOCK4_ADDR                       0x00900000U
#define N256K_BLOCK4_MASK                       (1UL << 0x4U)

#define N256K_BLOCK5_ADDR                       0x00940000U
#define N256K_BLOCK5_MASK                       (1UL << 0x5U)

#define N256K_BLOCK6_ADDR                       0x00980000U
#define N256K_BLOCK6_MASK                       (1UL << 0x6U)

#define N256K_BLOCK7_ADDR                       0x009C0000U
#define N256K_BLOCK7_MASK                       (1UL << 0x7U)

#define N256K_BLOCK8_ADDR                       0x00A00000U
#define N256K_BLOCK8_MASK                       (1UL << 0x8U)

#define N256K_BLOCK9_ADDR                       0x00A40000U
#define N256K_BLOCK9_MASK                       (1UL << 0x9U)

#define N256K_BLOCK10_ADDR                      0x00A80000U
#define N256K_BLOCK10_MASK                      (1UL << 0xAU)

#define N256K_BLOCK11_ADDR                      0x00AC0000U
#define N256K_BLOCK11_MASK                      (1UL << 0xBU)

