ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
#define N256K_BLOCK12_ADDR                      0x00B00000U
#define N256K_BLOCK12_MASK                      (1UL << 0xCU)

#define N256K_BLOCK13_ADDR                      0x00B40000U
#define N256K_BLOCK13_MASK                      (1UL << 0xDU)

#define N256K_BLOCK14_ADDR                      0x00B80000U
#define N256K_BLOCK14_MASK                      (1UL << 0xEU)

#define N256K_BLOCK15_ADDR                      0x00BC0000U
#define N256K_BLOCK15_MASK                      (1UL << 0xFU)

#define N256K_BLOCK16_ADDR                      0x00C00000U
#define N256K_BLOCK16_MASK                      (1UL << 0x10U)

#define N256K_BLOCK17_ADDR                      0x00C40000U
#define N256K_BLOCK17_MASK                      (1UL << 0x11U)

#define N256K_BLOCK18_ADDR                      0x00C80000U
#define N256K_BLOCK18_MASK                      (1UL << 0x12U)

#define N256K_BLOCK19_ADDR                      0x00CC0000U
#define N256K_BLOCK19_MASK                      (1UL << 0x13U)

#define N256K_BLOCK20_ADDR                      0x00D00000U
#define N256K_BLOCK20_MASK                      (1UL << 0x14U)

#define N256K_BLOCK21_ADDR                      0x00D40000U
#define N256K_BLOCK21_MASK                      (1UL << 0x15U)

#define N256K_BLOCK22_ADDR                      0x00D80000U
#define N256K_BLOCK22_MASK                      (1UL << 0x16U)

#define N256K_BLOCK23_ADDR                      0x00DC0000U
#define N256K_BLOCK23_MASK                      (1UL << 0x17U)

#define N256K_BLOCK24_ADDR                      0x00E00000U
#define N256K_BLOCK24_MASK                      (1UL << 0x18U)

#define N256K_BLOCK25_ADDR                      0x00E40000U
#define N256K_BLOCK25_MASK                      (1UL << 0x19U)

#define N256K_BLOCK26_ADDR                      0x00E80000U
#define N256K_BLOCK26_MASK                      (1UL << 0x1AU)

#define N256K_BLOCK27_ADDR                      0x00EC0000U
#define N256K_BLOCK27_MASK                      (1UL << 0x1BU)

#define N256K_BLOCK28_ADDR                      0x00F00000U
#define N256K_BLOCK28_MASK                      (1UL << 0x1CU)

#define N256K_BLOCK29_ADDR                      0x00F40000U
#define N256K_BLOCK29_MASK                      (1UL << 0x1DU)

#define N256K_BLOCK30_ADDR                      0x00F80000U
#define N256K_BLOCK30_MASK                      (1UL << 0x1EU)

#define N256K_BLOCK31_ADDR                      0x00FC0000U
#define N256K_BLOCK31_MASK                      (1UL << 0x1FU)

#define FLASH_BLOCK_ADDR_DEFINE \
{                               \
LOW_BLOCK0_ADDR, /* Low block 0 address */ \
LOW_BLOCK1_ADDR, /* Low block 1 address */ \
MID_BLOCK0_ADDR, /* Mid block 0 address */ \
MID_BLOCK1_ADDR, /* Mid block 1 address */ \
HIGH_BLOCK0_ADDR, /* High block 0 address */ \
HIGH_BLOCK1_ADDR, /* High block 1 address */ \
N256K_BLOCK0_ADDR, /* 256K block 0 address */  \
N256K_BLOCK1_ADDR, /* 256K block 1 address */  \
N256K_BLOCK2_ADDR, /* 256K block 2 address */  \
N256K_BLOCK3_ADDR, /* 256K block 3 address */  \
N256K_BLOCK4_ADDR, /* 256K block 4 address */  \
N256K_BLOCK5_ADDR, /* 256K block 5 address */  \
N256K_BLOCK6_ADDR, /* 256K block 6 address */  \
N256K_BLOCK7_ADDR, /* 256K block 7 address */  \
N256K_BLOCK8_ADDR, /* 256K block 8 address */  \
N256K_BLOCK9_ADDR, /* 256K block 9 address */  \
N256K_BLOCK10_ADDR, /* 256K block 10 address */  \
N256K_BLOCK11_ADDR, /* 256K block 11 address */  \
N256K_BLOCK12_ADDR, /* 256K block 12 address */  \
N256K_BLOCK13_ADDR, /* 256K block 13 address */  \
N256K_BLOCK14_ADDR, /* 256K block 14 address */  \
N256K_BLOCK15_ADDR, /* 256K block 15 address */  \
N256K_BLOCK16_ADDR, /* 256K block 16 address */  \
N256K_BLOCK17_ADDR, /* 256K block 17 address */  \
N256K_BLOCK18_ADDR, /* 256K block 18 address */  \
N256K_BLOCK19_ADDR, /* 256K block 19 address */  \
N256K_BLOCK20_ADDR, /* 256K block 20 address */  \
N256K_BLOCK21_ADDR, /* 256K block 21 address */  \
N256K_BLOCK22_ADDR, /* 256K block 10 address */  \
N256K_BLOCK23_ADDR, /* 256K block 11 address */  \
N256K_BLOCK24_ADDR, /* 256K block 12 address */  \
N256K_BLOCK25_ADDR, /* 256K block 13 address */  \
N256K_BLOCK26_ADDR, /* 256K block 14 address */  \
N256K_BLOCK27_ADDR, /* 256K block 15 address */  \
N256K_BLOCK28_ADDR, /* 256K block 16 address */  \
N256K_BLOCK29_ADDR, /* 256K block 17 address */  \
N256K_BLOCK30_ADDR, /* 256K block 18 address */  \
N256K_BLOCK31_ADDR /* 256K block 19 address */  \
}
#define FLASH_BLOCK_MASK_DEFINE \
{                              \
LOW_BLOCK0_MASK, /* Low block 0 mask */ \
LOW_BLOCK1_MASK, /* Low block 1 mask */ \
MID_BLOCK0_MASK, /* Mid block 0 mask */ \
MID_BLOCK1_MASK, /* Mid block 1 mask */ \
HIGH_BLOCK0_MASK, /* High block 0 mask */ \
HIGH_BLOCK1_MASK, /* High block 1 mask */ \
N256K_BLOCK0_MASK, /* 256K block 0 mask */  \
N256K_BLOCK1_MASK, /* 256K block 1 mask */  \
N256K_BLOCK2_MASK, /* 256K block 2 mask */  \
N256K_BLOCK3_MASK, /* 256K block 3 mask */  \
N256K_BLOCK4_MASK, /* 256K block 4 mask */  \
N256K_BLOCK5_MASK, /* 256K block 5 mask */  \
N256K_BLOCK6_MASK, /* 256K block 6 mask */  \
N256K_BLOCK7_MASK, /* 256K block 7 mask */  \
N256K_BLOCK8_MASK, /* 256K block 8 mask */  \
N256K_BLOCK9_MASK, /* 256K block 9 mask */  \
N256K_BLOCK10_MASK, /* 256K block 10 mask */  \
N256K_BLOCK11_MASK, /* 256K block 11 mask */  \
N256K_BLOCK12_MASK, /* 256K block 12 mask */  \
N256K_BLOCK13_MASK, /* 256K block 13 mask */  \
N256K_BLOCK14_MASK, /* 256K block 14 mask */  \
N256K_BLOCK15_MASK, /* 256K block 15 mask */  \
N256K_BLOCK16_MASK, /* 256K block 16 mask */  \
N256K_BLOCK17_MASK, /* 256K block 17 mask */  \
N256K_BLOCK18_MASK, /* 256K block 18 mask */  \
N256K_BLOCK19_MASK, /* 256K block 19 mask */  \
N256K_BLOCK20_MASK, /* 256K block 20 mask */  \
N256K_BLOCK21_MASK, /* 256K block 21 mask */  \
N256K_BLOCK22_MASK, /* 256K block 21 mask */  \
N256K_BLOCK23_MASK, /* 256K block 21 mask */  \
N256K_BLOCK24_MASK, /* 256K block 21 mask */  \
N256K_BLOCK25_MASK, /* 256K block 21 mask */  \
N256K_BLOCK26_MASK, /* 256K block 21 mask */  \
N256K_BLOCK27_MASK, /* 256K block 21 mask */  \
N256K_BLOCK28_MASK, /* 256K block 21 mask */  \
N256K_BLOCK29_MASK, /* 256K block 21 mask */  \
N256K_BLOCK30_MASK, /* 256K block 21 mask */  \
N256K_BLOCK31_MASK /* 256K block 21 mask */  \
}

/* EEE module features */

