ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* @brief DMA hardware version 2. */
#define FEATURE_DMA_HWV2
/* @brief Number of DMA channels. */
#define FEATURE_DMA_CHANNELS (64U)
/* @brief Number of DMA virtual channels. */
#define FEATURE_DMA_VIRTUAL_CHANNELS (FEATURE_DMA_CHANNELS * DMA_INSTANCE_COUNT)
/* @brief Number of DMA interrupt lines. */
#define FEATURE_DMA_CHANNELS_INTERRUPT_LINES (64U)
/* @brief Number of DMA virtual interrupt lines. */
#define FEATURE_DMA_VIRTUAL_CHANNELS_INTERRUPT_LINES ((uint32_t)100U)
/* @brief Number of DMA error interrupt lines. */
#define FEATURE_DMA_ERROR_INTERRUPT_LINES (2U)
/* @brief Number of DMA virtual error interrupt lines. */
#define FEATURE_DMA_VIRTUAL_ERROR_INTERRUPT_LINES ((uint32_t)FEATURE_DMA_ERROR_INTERRUPT_LINES * (uint32_t)DMA_INSTANCE_COUNT)
/* @brief DMA module has error interrupt. */
#define FEATURE_DMA_HAS_ERROR_IRQ
/* @brief DMA module separate interrupt lines for each channel */
#define FEATURE_DMA_SEPARATE_IRQ_LINES_PER_CHN
/* @brief DMA module 'ORed' intrerupt line for specific channels */
#define FEATURE_DMA1_CH32_CH39_ORED_IRQ_LINES
#define FEATURE_DMA1_CH40_CH47_ORED_IRQ_LINES
#define FEATURE_DMA1_CH48_CH55_ORED_IRQ_LINES
#define FEATURE_DMA1_CH56_CH63_ORED_IRQ_LINES
/* @brief Conversion from channel index to DCHPRI index. */
#define FEATURE_DMA_CHN_TO_DCHPRI_INDEX(x) (x)
/* @brief DMA channel groups count. */
#define FEATURE_DMA_CHANNEL_GROUP_COUNT (2U)
/* @brief Clock name for DMA */
#define FEATURE_DMA_CLOCK_NAMES {DMA0_CLK, DMA1_CLK}
/* @brief Macros defined for compatibility with ARM platforms */
#define DMA_TCD_CITER_ELINKYES_CITER_LE_MASK   DMA_TCD_CITER_ELINKYES_CITER_MASK
#define DMA_TCD_CITER_ELINKYES_CITER_LE_SHIFT  DMA_TCD_CITER_ELINKYES_CITER_SHIFT
#define DMA_TCD_CITER_ELINKYES_CITER_LE_WIDTH  DMA_TCD_CITER_ELINKYES_CITER_WIDTH
#define DMA_TCD_CITER_ELINKYES_CITER_LE(x)     DMA_TCD_CITER_ELINKYES_CITER(x)
/* @brief DMA channel width based on number of TCDs: 2^N, N=4,5,... */
#define FEATURE_DMA_CH_WIDTH (6U)
/* @brief DMA channel to instance */
#define FEATURE_DMA_VCH_TO_INSTANCE(x) 	((x) >> (uint32_t)FEATURE_DMA_CH_WIDTH)
/* @brief DMA virtual channel to channel */
#define FEATURE_DMA_VCH_TO_CH(x)        ((x) & ((uint32_t)FEATURE_DMA_CHANNELS - 1U))
/* @brief DMA supports the following particular transfer size: */
#define FEATURE_DMA_TRANSFER_SIZE_8B
#define FEATURE_DMA_TRANSFER_SIZE_32B


/* DMAMUX module features */

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum {
    EDMA_REQ_EQADC_0_CFFF0           = 0U,
    EDMA_REQ_EQADC_0_RFDF0           = 1U,
    EDMA_REQ_EQADC_0_CFFF1           = 2U,
    EDMA_REQ_EQADC_0_RFDF1           = 3U,
    EDMA_REQ_EQADC_0_CFFF2           = 4U,
    EDMA_REQ_EQADC_0_RFDF2           = 5U,
    EDMA_REQ_EQADC_0_CFFF3           = 6U,
    EDMA_REQ_EQADC_0_RFDF3           = 7U,
    EDMA_REQ_EQADC_0_CFFF4           = 8U,
    EDMA_REQ_EQADC_0_RFDF4           = 9U,
    EDMA_REQ_EQADC_0_CFFF5           = 10U,
    EDMA_REQ_EQADC_0_RFDF5           = 11U,
    EDMA_REQ_DSPI_1_TFFF             = 12U,
    EDMA_REQ_DSPI_1_RFDF             = 13U,
    EDMA_REQ_DSPI_2_TFFF             = 14U,
    EDMA_REQ_DSPI_2_RFDF             = 15U,
    EDMA_REQ_DSPI_3_TFFF             = 16U,
    EDMA_REQ_DSPI_3_RFDF             = 17U,
    EDMA_REQ_ESCI_0_TX               = 18U,
    EDMA_REQ_ESCI_0_RX               = 19U,
    EDMA_REQ_EMIOS_0_CH0             = 20U,
    EDMA_REQ_EMIOS_0_CH1             = 21U,
    EDMA_REQ_EMIOS_0_CH2             = 22U,
    EDMA_REQ_EMIOS_0_CH3             = 23U,
    EDMA_REQ_EMIOS_0_CH4             = 24U,
    EDMA_REQ_EMIOS_1_CH0             = 25U,
    EDMA_REQ_EMIOS_1_CH1             = 26U,
    EDMA_REQ_ETPU_01_CH0_ENG1_DTRS   = 27U,
    EDMA_REQ_ETPU_01_CH1_ENG1_DTRS   = 28U,
    EDMA_REQ_ETPU_01_CH2_ENG1_DTRS   = 29U,
    EDMA_REQ_ETPU_01_CH14_ENG1_DTRS  = 30U,
    EDMA_REQ_ETPU_01_CH15_ENG1_DTRS  = 31U,
    EDMA_REQ_DSPI_0_TFFF             = 32U,
    EDMA_REQ_DSPI_0_RFDF             = 33U,
    EDMA_REQ_ESCI_1_TX               = 34U,
    EDMA_REQ_ESCI_1_RX               = 35U,
    EDMA_REQ_EMIOS_0_CH6             = 36U,
    EDMA_REQ_EMIOS_0_CH7             = 37U,
    EDMA_REQ_EMIOS_1_CH2             = 38U,
    EDMA_REQ_EMIOS_1_CH3             = 39U,
    EDMA_REQ_EMIOS_0_CH16            = 40U,
    EDMA_REQ_EMIOS_0_CH17            = 41U,
    EDMA_REQ_EMIOS_0_CH18            = 42U,
    EDMA_REQ_EMIOS_0_CH19            = 43U,
    EDMA_REQ_ETPU_01_CH12_ENG1_DTRS  = 44U,
    EDMA_REQ_ETPU_01_CH13_ENG1_DTRS  = 45U,
    EDMA_REQ_ETPU_01_CH28_ENG1_DTRS  = 46U,
    EDMA_REQ_ETPU_01_CH29_ENG1_DTRS  = 47U,
    EDMA_REQ_SIU_EIF0                = 48U,
    EDMA_REQ_SIU_EIF1                = 49U,
    EDMA_REQ_SIU_EIF2                = 50U,
    EDMA_REQ_SIU_EIF3                = 51U,
    EDMA_REQ_ETPU_01_CH0_ENG2_DTRS   = 52U,
    EDMA_REQ_ETPU_01_CH1_ENG2_DTRS   = 53U,
    EDMA_REQ_ETPU_01_CH2_ENG2_DTRS   = 54U,
    EDMA_REQ_ETPU_01_CH3_ENG2_DTRS   = 55U,
    EDMA_REQ_ETPU_01_CH12_ENG2_DTRS  = 56U,
    EDMA_REQ_ETPU_01_CH13_ENG2_DTRS  = 57U,
    EDMA_REQ_ETPU_01_CH14_ENG2_DTRS  = 58U,
    EDMA_REQ_ETPU_01_CH15_ENG2_DTRS  = 59U,
    EDMA_REQ_ETPU_01_CH28_ENG2_DTRS  = 60U,
    EDMA_REQ_ETPU_01_CH29_ENG2_DTRS  = 61U,
    EDMA_REQ_ETPU_01_CH30_ENG2_DTRS  = 62U,
    EDMA_REQ_ETPU_01_CH31_ENG2_DTRS  = 63U,
    EDMA_REQ_EQADC_1_CFFF0           = 64U,
    EDMA_REQ_EQADC_1_RFDF0           = 65U,
    EDMA_REQ_EQADC_1_CFFF1           = 66U,
    EDMA_REQ_EQADC_1_RFDF1           = 67U,
    EDMA_REQ_EQADC_1_CFFF2           = 68U,
    EDMA_REQ_EQADC_1_RFDF2           = 69U,
    EDMA_REQ_EQADC_1_CFFF3           = 70U,
    EDMA_REQ_EQADC_1_RFDF3           = 71U,
    EDMA_REQ_EQADC_1_CFFF4           = 72U,
    EDMA_REQ_EQADC_1_RFDF4           = 73U,
    EDMA_REQ_EQADC_1_CFFF5           = 74U,
    EDMA_REQ_EQADC_1_RFDF5           = 75U,
    EDMA_REQ_DECFILTER_0_IB          = 76U,
    EDMA_REQ_DECFILTER_0_OB_INT      = 77U,
    EDMA_REQ_DECFILTER_1_IB          = 78U,
    EDMA_REQ_DECFILTER_1_OB_INT      = 79U,
    EDMA_REQ_DECFILTER_2_IB          = 80U,
    EDMA_REQ_DECFILTER_2_OB_INT      = 81U,
    EDMA_REQ_DECFILTER_3_IB          = 82U,
    EDMA_REQ_DECFILTER_3_OB_INT      = 83U,
    EDMA_REQ_DECFILTER_4_IB          = 84U,
    EDMA_REQ_DECFILTER_4_OB_INT      = 85U,
    EDMA_REQ_DECFILTER_5_IB          = 86U,
    EDMA_REQ_DECFILTER_5_OB_INT      = 87U,
    EDMA_REQ_DECFILTER_6_IB          = 88U,
    EDMA_REQ_DECFILTER_6_OB_INT      = 89U,
    EDMA_REQ_DECFILTER_7_IB          = 90U,
    EDMA_REQ_DECFILTER_7_OB_INT      = 91U,
    EDMA_REQ_DECFILTER_8_IB          = 92U,
    EDMA_REQ_DECFILTER_8_OB_INT      = 93U,
    EDMA_REQ_DECFILTER_9_IB          = 94U,
    EDMA_REQ_DECFILTER_9_OB_INT      = 95U,
    EDMA_REQ_DECFILTER_10_IB         = 96U,
    EDMA_REQ_DECFILTER_10_OB_INT     = 97U,
    EDMA_REQ_DECFILTER_11_IB         = 98U,
    EDMA_REQ_DECFILTER_11_OB_INT     = 99U,
    EDMA_REQ_SDADC_0                 = 100U,
    EDMA_REQ_SDADC_1                 = 101U,
    EDMA_REQ_SDADC_2                 = 102U,
    EDMA_REQ_SDADC_3                 = 103U,
    EDMA_REQ_SRX_0_FAST              = 104U,
    EDMA_REQ_SRX_1_FAST              = 105U,
    EDMA_REQ_SRX_0_SLOW              = 106U,
    EDMA_REQ_SRX_1_SLOW              = 107U,
    EDMA_REQ_ETPU_2_CH0_ENG1_DTRS    = 108U,
    EDMA_REQ_ETPU_2_CH1_ENG1_DTRS    = 109U,
    EDMA_REQ_ETPU_2_CH2_ENG1_DTRS    = 110U,
    EDMA_REQ_ETPU_2_CH3_ENG1_DTRS    = 111U,
    EDMA_REQ_ETPU_2_CH4_ENG1_DTRS    = 112U,
    EDMA_REQ_ETPU_2_CH5_ENG1_DTRS    = 113U,
    EDMA_REQ_ETPU_2_CH6_ENG1_DTRS    = 114U,
    EDMA_REQ_ETPU_2_CH7_ENG1_DTRS    = 115U,
    EDMA_REQ_PSI5_0_SMC              = 116U,
    EDMA_REQ_PSI5_0_DIAG             = 117U,
    EDMA_REQ_PSI5_1_SMC              = 118U,
    EDMA_REQ_PSI5_1_DIAG             = 119U,
    EDMA_REQ_SIPI_CH0                = 120U,
    EDMA_REQ_SIPI_CH1                = 121U,
    EDMA_REQ_SIPI_CH2                = 122U,
    EDMA_REQ_SIPI_CH3                = 123U,
    EDMA_REQ_M_CAN_0                 = 124U,
    EDMA_REQ_DSPI_5_TFFF             = 125U,
    EDMA_REQ_DSPI_5_RFDF             = 126U,
    EDMA_REQ_M_CAN_1                 = 127U
} dma_request_source_t;

/* EIM module features */

