ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* @brief The EIM check-bit mask has 32 bits */
#define FEATURE_EIM_CHECKBITMASK_32BIT
/* @brief The EIM has data mask 1 */
#define FEATURE_EIM_DATAMASK1
/* @brief The EIM channel types */
#define FEATURE_EIM_CH_TYPE_0 (0U)
#define FEATURE_EIM_CH_TYPE_1 (1U)
#define FEATURE_EIM_CH_TYPE_2 (2U)
/* @brief The EIM channel type structure */
#define FEATURE_EIM_CH_TYPE \
{                                \
FEATURE_EIM_CH_TYPE_0,         /* Channel type corresponding to channel 0  */       \
FEATURE_EIM_CH_TYPE_0,         /* Channel type corresponding to channel 1  */       \
FEATURE_EIM_CH_TYPE_1,         /* Channel type corresponding to channel 2  */       \
FEATURE_EIM_CH_TYPE_2,         /* Channel type corresponding to channel 3  */       \
FEATURE_EIM_CH_TYPE_0,         /* Channel type corresponding to channel 4  */       \
FEATURE_EIM_CH_TYPE_0,         /* Channel type corresponding to channel 5  */       \
}
/* @brief The EIM number of data words for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_NUM_OF_DATA_WORDS (2U)
#define FEATURE_EIM_CH_TYPE_1_NUM_OF_DATA_WORDS (1U)
#define FEATURE_EIM_CH_TYPE_2_NUM_OF_DATA_WORDS (2U)
/* @brief The EIM WORD0 bitfields for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_WORD0_MASK      0xFF000000u
#define FEATURE_EIM_CH_TYPE_0_WORD0_SHIFT     24u
#define FEATURE_EIM_CH_TYPE_0_WORD0_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_0_WORD0_SHIFT))&FEATURE_EIM_CH_TYPE_0_WORD0_MASK)
#define FEATURE_EIM_CH_TYPE_0_WORD0_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_0_WORD0_MASK))>>FEATURE_EIM_CH_TYPE_0_WORD0_SHIFT)
#define FEATURE_EIM_CH_TYPE_1_WORD0_MASK      0xFF000000u
#define FEATURE_EIM_CH_TYPE_1_WORD0_SHIFT     24u
#define FEATURE_EIM_CH_TYPE_1_WORD0_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_1_WORD0_SHIFT))&FEATURE_EIM_CH_TYPE_1_WORD0_MASK)
#define FEATURE_EIM_CH_TYPE_1_WORD0_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_1_WORD0_MASK))>>FEATURE_EIM_CH_TYPE_1_WORD0_SHIFT)
#define FEATURE_EIM_CH_TYPE_2_WORD0_MASK      0xFF000000u
#define FEATURE_EIM_CH_TYPE_2_WORD0_SHIFT     24u
#define FEATURE_EIM_CH_TYPE_2_WORD0_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_2_WORD0_SHIFT))&FEATURE_EIM_CH_TYPE_2_WORD0_MASK)
#define FEATURE_EIM_CH_TYPE_2_WORD0_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_2_WORD0_MASK))>>FEATURE_EIM_CH_TYPE_2_WORD0_SHIFT)
/* @brief The EIM WORD1 bitfields for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_WORD1_MASK      0xFFFFFFFFu
#define FEATURE_EIM_CH_TYPE_0_WORD1_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_0_WORD1_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_0_WORD1_SHIFT))&FEATURE_EIM_CH_TYPE_0_WORD1_MASK)
#define FEATURE_EIM_CH_TYPE_0_WORD1_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_0_WORD1_MASK))>>FEATURE_EIM_CH_TYPE_0_WORD1_SHIFT)
#define FEATURE_EIM_CH_TYPE_1_WORD1_MASK      0xFFFFFFFFu
#define FEATURE_EIM_CH_TYPE_1_WORD1_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_1_WORD1_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_1_WORD1_SHIFT))&FEATURE_EIM_CH_TYPE_1_WORD1_MASK)
#define FEATURE_EIM_CH_TYPE_1_WORD1_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_1_WORD1_MASK))>>FEATURE_EIM_CH_TYPE_1_WORD1_SHIFT)
#define FEATURE_EIM_CH_TYPE_2_WORD1_MASK      0x0000000Fu
#define FEATURE_EIM_CH_TYPE_2_WORD1_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_2_WORD1_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_2_WORD1_SHIFT))&FEATURE_EIM_CH_TYPE_2_WORD1_MASK)
#define FEATURE_EIM_CH_TYPE_2_WORD1_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_2_WORD1_MASK))>>FEATURE_EIM_CH_TYPE_2_WORD1_SHIFT)
/* @brief The EIM WORD2 bitfields for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_WORD2_MASK      0xFFFFFFFFu
#define FEATURE_EIM_CH_TYPE_0_WORD2_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_0_WORD2_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_0_WORD2_SHIFT))&FEATURE_EIM_CH_TYPE_0_WORD2_MASK)
#define FEATURE_EIM_CH_TYPE_0_WORD2_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_0_WORD2_MASK))>>FEATURE_EIM_CH_TYPE_0_WORD2_SHIFT)
#define FEATURE_EIM_CH_TYPE_2_WORD2_MASK      0xFFFFFFFFu
#define FEATURE_EIM_CH_TYPE_2_WORD2_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_2_WORD2_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_2_WORD2_SHIFT))&FEATURE_EIM_CH_TYPE_2_WORD2_MASK)
#define FEATURE_EIM_CH_TYPE_2_WORD2_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_2_WORD2_MASK))>>FEATURE_EIM_CH_TYPE_2_WORD2_SHIFT)

/* CTU (Cross Triggering Unit) module features */

/*!
 * @brief Macro defining number of ETIMER instances connected to the CTU
 */
#define CTU_ETIMER_COUNT   			 (ETIMER_INSTANCE_COUNT)

/*! @brief Number of ADC instances which can be triggered by CTU */
#define FEATURE_CTU_NUM_ADC          (2u)


/* ADC module features */
#define FEATURE_ADC_HAS_CTU_TRIGGER_MODE (0)

#define ADC_PRESAMPLE_VSS_HV         (ADC_PRESAMPLE_SRC0)    /* Presampling from High voltage ground for ADC*/
#define ADC_PRESAMPLE_VDD_HV_DIV_8   (ADC_PRESAMPLE_SRC1)    /* Presampling from ower High voltage Supply for ADC, SGEN divided by 8 */
#define ADC_PRESAMPLE_VSS_HV_ADRE1   (ADC_PRESAMPLE_SRC2)    /* Presampling from High voltage ground for ADC/TSENS */
#define ADC_PRESAMPLE_VDD_HV_ADRE1   (ADC_PRESAMPLE_SRC3)    /* Presampling from High voltage reference for ADC/TSENS */

#define ADC_CLOCKS                    {ADC0_CLK, ADC1_CLK, ADC2_CLK, ADC3_CLK}


/* SDADC module features */
/*! @brief SDADC instances has common trigger selection */
#define FEATURE_SDADC_HAS_COMMON_TRIGGER_SELECTION (1)
/*! @brief SDADC instances has common DMA and Interrupt gating selection */
#define FEATURE_SDADC_HAS_COMMON_DMAINT_GATE_SELECTION (1)
/*! @brief SDADC clocks */
#define SDADC_CLOCKS                  {ADCSD1_CLK, ADCSD2_CLK, ADCSD3_CLK, ADCSD4_CLK}
/* @brief Max of SDADC clock frequency */
#define SDADC_CLOCK_FREQ_MAX_RUNTIME     (16000000u)
/* @brief Min of SDADC clock frequency */
#define SDADC_CLOCK_FREQ_MIN_RUNTIME     (4000000u)
/*! @brief SDADC instances number */
#define FEATURE_SDADC_HAS_INSTANCE_NUMBER    (4u)
/*! @brief SDADC initial gain error table */
#define SDADC_GAIN_ERROR   {65536, 65536, 65536, 65536}
/*! @brief DMA channel number for SDADC instances */
#define SDADC_DMA_CHANNEL_NUMBER   {0xFFu, 0xFFu, 0xFFu, 0xFFu}
/*! @brief Interrupts from all SDADC instances are mapped to a single interrupt vector */
#define FEATURE_SDADC_INSTANCES_HAVE_COMMON_INT_VECTOR  (1)


/* EQADC module features */
#define EQADC_NUM_ADC                 (2u)					 /* Number of on-chip ADC modules per EQADC instance */
/*! @brief EQADC system clocks */
#define EQADC_CLOCKS                  {EQADC0_CLK, EQADC1_CLK}
/* @brief Max of on chip ADC clock frequency */
#define EQADC_ON_CHIP_ADC_CLOCK_FREQ_MAX_RUNTIME     (33000000u)
/* @brief Min of on chip ADC clock frequency */
#define EQADC_ON_CHIP_ADC_CLOCK_FREQ_MIN_RUNTIME     (2000000u)

/* DSPI module feature */

/* Define the PCS allocation for each DSPI/SPI module */
#define FEATURE_SPI_0_PCS_NUMBER 6
#define FEATURE_SPI_1_PCS_NUMBER 6
#define FEATURE_SPI_2_PCS_NUMBER 6
#define FEATURE_SPI_3_PCS_NUMBER 6
#define FEATURE_SPI_4_PCS_NUMBER 6

#define FEATURE_DSPI_PCS_MAPPING {FEATURE_SPI_0_PCS_NUMBER, FEATURE_SPI_1_PCS_NUMBER, \
                                 FEATURE_SPI_2_PCS_NUMBER, FEATURE_SPI_3_PCS_NUMBER, FEATURE_SPI_4_PCS_NUMBER}

/* Define the instance realocation */
#define FEATURE_DSPI_INSTANCES  {DSPI_0, DSPI_1, DSPI_2, DSPI_3, DSPI_4}

/* Define the initial values for state structures */
#define FEATURE_DSPI_INITIAL_STATE {NULL, NULL, NULL, NULL, NULL}

/* Define clock sources for SPI/DSPI instances */
#define FEATURE_DSPI_CLOCK_MAPPING {DSPI0_CLK, DSPI1_CLK, DSPI2_CLK, DSPI3_CLK, DSPI4_CLK}

/* Define margins of instances interval */
#define SPI_LOWEST_INSTANCE 0U
#define SPI_HIGHEST_INSTANCE 3U

/* Define FIFO size */
#define DSPI_FIFO_SIZE 4U

/* Each interrupt flag has it's own interrupt index */
#define FEATURES_DSPI_HAS_INDEPENDENT_INTERRUPTS 0U

/* Define number of DSPI instances */
#define SPI_INSTANCE_COUNT         0U

/* Define interrupt vector for dspi */
#define FEATURES_DSPI_SEND_INTERUPT_VECTOR    { DSPI0_TXFIFO_TFFF_IRQn, DSPI1_TXFIFO_TFFF_IRQn, DSPI2_TXFIFO_TFFF_IRQn, DSPI3_TXFIFO_TFFF_IRQn, DSPI4_TXFIFO_TFFF_IRQn}
#define FEATURES_DSPI_RECEIVE_INTERUPT_VECTOR { DSPI0_RXFIFO_RFDF_IRQn, DSPI1_RXFIFO_RFDF_IRQn, DSPI2_RXFIFO_RFDF_IRQn, DSPI3_RXFIFO_RFDF_IRQn, DSPI4_RXFIFO_RFDF_IRQn}
#define FEATURES_DSPI_FAULT_INTERUPT_VECTOR   { DSPI0_ERR_IRQn        , DSPI1_ERR_IRQn        , DSPI2_ERR_IRQn        , DSPI3_ERR_IRQn        , DSPI4_ERR_IRQn}

