ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* SRX module features */

/* Combined Interrupts */
#define FEATURE_SRX_HAS_COMBINED_IRQ

/* Has FIFO */
#define FEATURE_SRX_DMA_HAS_FIFO

/* Maximum Fast messages FIFO depth */
#define FEATURE_SRX_MAX_FIFO_SIZE (16U)

/* Has nibble length limit */
#define FEATURE_SRX_HAS_NIB_LEN_VAR_LIMIT

/* Mappings */
#define FEATURE_SRX_FAST_DMA_REQS {EDMA_REQ_SRX_0_FAST, EDMA_REQ_SRX_1_FAST}
#define FEATURE_SRX_SLOW_DMA_REQS {EDMA_REQ_SRX_0_SLOW, EDMA_REQ_SRX_1_SLOW}
#define FEATURE_SRX_CLOCK_NAMES {SENT0_CLK, SENT1_CLK}
#define FEATURE_SRX_IRQS {{SRX0_CH0_IRQn, SRX0_CH1_IRQn, SRX0_CH2_IRQn, SRX0_CH3_IRQn, SRX0_CH4_IRQn, SRX0_CH5_IRQn}, \
                          {SRX1_CH0_IRQn, SRX1_CH1_IRQn, SRX1_CH2_IRQn, SRX1_CH3_IRQn, SRX1_CH4_IRQn, SRX1_CH5_IRQn}}

/* PSI5 module features */

/* Channel count */
#define FEATURE_PSI5_CHANNEL_COUNT (1U)
/* Channel count */
#define FEATURE_PSI5_SLOT_COUNT (PSI5_CH0_SFR_COUNT)
/* Maximum number of FIFO locations */
#define FEATURE_PSI5_FIFO_COUNT (PSI5_CH0_PMR_COUNT)
/* Master instance */
#define FEATURE_PSI5_MASTER_INSTANCE (0U)
/* Mappings */
#define FEATURE_PSI5_IRQS {{PSI50_SDOE_IRQn}, {PSI51_SDOE_IRQn}}

/* ENET module features */

/*! @brief ENET peripheral clock names */
#define FEATURE_ENET_CLOCK_NAMES { FEC0_CLK }

/*! @brief The transmission interrupts */
#define FEATURE_ENET_TX_IRQS        FEC_TX_IRQS
/*! @brief The reception interrupts */
#define FEATURE_ENET_RX_IRQS        FEC_RX_IRQS
/*! @brief The error interrupts */
#define FEATURE_ENET_ERR_IRQS       FEC_ERR_IRQS

/*! @brief The maximum supported frequency for MDC, in Hz. */
#define FEATURE_ENET_MDC_MAX_FREQUENCY 2500000U

/*! @brief Minimum hold time on the MDIO output, in nanoseconds. */
#define FEATURE_ENET_MDIO_MIN_HOLD_TIME_NS 10U

/*! @brief Definitions used for aligning the data buffers */
#define FEATURE_ENET_BUFF_ALIGNMENT      (16UL)
/*! @brief Definitions used for aligning the buffer descriptors */
#define FEATURE_ENET_BUFFDESCR_ALIGNMENT (64UL)

/*! @brief Has receive frame parser feature. */
#define FEATURE_ENET_HAS_RECEIVE_PARSER (0)

/*! @brief Has enhanced buffer descriptors programming model. */
#define FEATURE_ENET_HAS_ENHANCED_BD    (0)

/*! @brief Default configuration for the PHY interface */
#define FEATURE_ENET_DEFAULT_PHY_IF     ENET_RMII_MODE

/*! @brief Has adjustable timer enabling IEEE 1588 support */
#define FEATURE_ENET_HAS_ADJUSTABLE_TIMER (0)

/*! @brief Has support for configuring the width of the output compare pulse */
#define FEATURE_ENET_HAS_TIMER_PULSE_WIDTH_CONTROL (0)

/*! @brief The number of available receive and transmit buffer descriptor rings */
#define FEATURE_ENET_RING_COUNT             (1U)

/*! @brief The number of available VLAN priority compare values per class */
#define FEATURE_ENET_CLASS_MATCH_CMP_COUNT  (0U)

/*! @brief Has credit-based shaper */
#define FEATURE_ENET_HAS_CBS                (0)

/*! @brief Has time-based shaper */
#define FEATURE_ENET_HAS_TBS                (0)

/*! @brief Has interrupt coalescing */
#define FEATURE_ENET_HAS_INTCOAL            (0)

/*! @brief Has RGMII mode for data interface */
#define FEATURE_ENET_HAS_RGMII              (0)

/*! @brief Has 1000-Mbit/s speed mode */
#define FEATURE_ENET_HAS_SPEED_1000M        (0)

/*! @brief Has Receive and Transmit accelerator */
#define FEATURE_ENET_HAS_ACCELERATOR		(0)

/*! @brief Has Sleep and Wakeup functionalities */
#define FEATURE_ENET_HAS_SLEEP_WAKEUP		(0)

/*! @brief Has configurable FIFO thresholds */
#define FEATURE_ENET_HAS_CONFIG_FIFO_THRESHOLDS	(0)

/*! @brief RX Configuration features */
#define FEATURE_ENET_HAS_RX_CONFIG					(1)
#define FEATURE_ENET_RX_CONFIG_PAYLOAD_LEN_CHECK	(0)
#define FEATURE_ENET_RX_CONFIG_STRIP_CRC_FIELD		(0)
#define FEATURE_ENET_RX_CONFIG_REMOVE_PADDING		(0)
#define FEATURE_ENET_RX_CONFIG_FORWARD_PAUSE_FRAMES	(0)

/*! @brief TX Configuration features */
#define FEATURE_ENET_HAS_TX_CONFIG	(0)

/*! @brief Offset of the MIB block counters area in bytes */
#define FEATURE_ENET_MIB_COUNTERS_OFFSET	(0x200U)
/*! @brief Size of the MIB block counters area in words */
#define FEATURE_ENET_MIB_COUNTERS_SIZE		(0x80U)

/*! @brief The minimum size of the Tx ring */
#define FEATURE_ENET_TX_MIN_RING_SIZE       (2U)

#define ENET_Type FEC_Type

#define ENET_INSTANCE_COUNT	FEC_INSTANCE_COUNT
#define ENET_BASE_PTRS		FEC_BASE_PTRS

#define ENET_EIR_BABR_MASK	FEC_EIR_BABR_MASK
#define ENET_EIR_BABT_MASK	FEC_EIR_BABT_MASK
#define ENET_EIR_GRA_MASK	FEC_EIR_GRA_MASK
#define ENET_EIR_TXF_MASK	FEC_EIR_TXF_MASK
#define ENET_EIR_TXB_MASK	FEC_EIR_TXB_MASK
#define ENET_EIR_RXF_MASK	FEC_EIR_RXF_MASK
#define ENET_EIR_RXB_MASK	FEC_EIR_RXB_MASK
#define ENET_EIR_MII_MASK	FEC_EIR_MII_MASK
#define ENET_EIR_EBERR_MASK	FEC_EIR_EBERR_MASK
#define ENET_EIR_LC_MASK	FEC_EIR_LC_MASK
#define ENET_EIR_RL_MASK	FEC_EIR_RL_MASK
#define ENET_EIR_UN_MASK	FEC_EIR_UN_MASK

#define ENET_MMFR_DATA_MASK		FEC_MMFR_DATA_MASK
#define ENET_MMFR_ST			FEC_MMFR_ST
#define ENET_MMFR_OP			FEC_MMFR_OP
#define ENET_MMFR_PA			FEC_MMFR_PA
#define ENET_MMFR_RA			FEC_MMFR_RA
#define ENET_MMFR_TA			FEC_MMFR_TA
#define ENET_MMFR_DATA			FEC_MMFR_DATA
#define ENET_PAUR_PADDR2_MASK	FEC_PAUR_PADDR2_MASK
#define ENET_PAUR_PADDR2_SHIFT	FEC_PAUR_PADDR2_SHIFT
#define ENET_ECR_ETHEREN_MASK	FEC_ECR_ETHER_EN_MASK
#define ENET_TDAR_TDAR_MASK		FEC_TDAR_TDAR_MASK
#define ENET_RDAR_RDAR_MASK		FEC_RDAR_RDAR_MASK
#define ENET_ECR_RESET_MASK		FEC_ECR_RESET_MASK

/* CAN module features */

/* @brief Frames available in Rx FIFO flag shift */
#define FEATURE_CAN_RXFIFO_FRAME_AVAILABLE  (5U)
/* @brief Rx FIFO warning flag shift */
#define FEATURE_CAN_RXFIFO_WARNING          (6U)
/* @brief Rx FIFO overflow flag shift */
#define FEATURE_CAN_RXFIFO_OVERFLOW         (7U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN0 */
#define FEATURE_CAN0_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN1 */
#define FEATURE_CAN1_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN2 */
#define FEATURE_CAN2_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN3 */
#define FEATURE_CAN3_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for any of the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM              (64U)
/* @brief Array of maximum number of Message Buffers supported for payload size 8 for all the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM_ARRAY        { FEATURE_CAN0_MAX_MB_NUM, \
                                              FEATURE_CAN1_MAX_MB_NUM, \
                                              FEATURE_CAN2_MAX_MB_NUM, \
                                              FEATURE_CAN3_MAX_MB_NUM  }
/* @brief Has PE clock source select (bit field CAN_CTRL1[CLKSRC]). */
#define FEATURE_CAN_HAS_PE_CLKSRC_SELECT            (1)
/* @brief Has Pretending Networking mode */
#define FEATURE_CAN_HAS_PRETENDED_NETWORKING        (0)
/* @brief Has Stuff Bit Count Enable Bit */
#define FEATURE_CAN_HAS_STFCNTEN_ENABLE             (0)
/* @brief Has ISO CAN FD Enable Bit */
#define FEATURE_CAN_HAS_ISOCANFDEN_ENABLE           (0)
/* @brief Has Message Buffer Data Size Region 1 */
#define FEATURE_CAN_HAS_MBDSR1                      (0)
/* @brief Has Message Buffer Data Size Region 2 */
#define FEATURE_CAN_HAS_MBDSR2                      (0)
/* @brief Has Supervisor Mode MCR[SUPV]*/
#define FEATURE_CAN_HAS_SUPV             	        (1)
/* @brief Has DMA enable (bit field MCR[DMA]). */
#define FEATURE_CAN_HAS_DMA_ENABLE                  (0)
/* @brief Maximum number of Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS_MAX_COUNT       (18U)
/* @brief Has Wake Up Irq channels (CAN_Wake_Up_IRQS_CH_COUNT > 0u) */
#define FEATURE_CAN_HAS_WAKE_UP_IRQ         (0U)
/* @brief Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS                 { CAN_ORed_00_MB_IRQS, \
                                              CAN_ORed_01_MB_IRQS, \
                                              CAN_ORed_02_MB_IRQS, \
                                              CAN_ORed_03_MB_IRQS, \
                                              CAN_ORed_04_MB_IRQS, \
                                              CAN_ORed_05_MB_IRQS, \
                                              CAN_ORed_06_MB_IRQS, \
                                              CAN_ORed_07_MB_IRQS, \
                                              CAN_ORed_08_MB_IRQS, \
                                              CAN_ORed_09_MB_IRQS, \
                                              CAN_ORed_10_MB_IRQS, \
                                              CAN_ORed_11_MB_IRQS, \
                                              CAN_ORed_12_MB_IRQS, \
                                              CAN_ORed_13_MB_IRQS, \
                                              CAN_ORed_14_MB_IRQS, \
                                              CAN_ORed_15_MB_IRQS, \
                                              CAN_ORed_16_31_MB_IRQS, \
                                              CAN_ORed_32_63_MB_IRQS }
/*! @brief FlexCAN Embedded RAM address offset */
#define FEATURE_CAN_RAM_OFFSET              (0x00000080u)
/* @brief Has Self Wake Up mode */
#define FEATURE_CAN_HAS_SELF_WAKE_UP        (0)
/* @brief Has Flexible Data Rate */
#define FEATURE_CAN_HAS_FD                  (0)
/* @brief The list contains definitions of the FD feature support on all instances */
#define FEATURE_CAN_INSTANCES_HAS_FD        {false, false, false, false}

