ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
#define CAN_IMASK1_BUF31TO0M_MASK           CAN_IMASK1_BUFLM_MASK
#define CAN_IMASK2_BUF63TO32M_MASK          CAN_IMASK2_BUFHM_MASK
/* @brief Clock name for the PE oscillator clock source */
#define FEATURE_CAN_PE_OSC_CLK_NAME         XOSC_CLK
/* @bried FlexCAN has Detection And Correction of Memory Errors */
#define FEATURE_CAN_HAS_MEM_ERR_DET         (1)
/* @bried FlexCAN has ECC requires clear of RXMASKs reg */
#define FEATURE_CAN_ECC_CLEAR_RXMASKS       (0)

/* SIU module feature */
/** GPIO - Register Layout Typedef */
typedef struct {
  __IO uint32_t PGPDO; /**< Parallel GPIO Pin Data Output Registers, array offset: 0xC00, array step: 0x4 */
       uint32_t RESERVED_PGPDO[SIU_PGPDO_COUNT - 1U];
  __I  uint32_t PGPDI; /**< Parallel GPIO Pin Data Input  Registers, array offset: 0xC40, array step: 0x4 */
} GPIO_Type;

/** Number of GPIO instances of the SIU module. */
#define GPIO_INSTANCE_COUNT                  (SIU_PGPDO_COUNT)
/** Peripheral SIU base address */
#define GPIO_BASE                            (0xC3F90C00u)
/** Peripheral GPIO base pointer */
#define GPIO                                 ((GPIO_Type *)GPIO_BASE)
 /* GPIO - Peripheral instance base addresses */
#define PTC                                  ((GPIO_Type *)(GPIO_BASE + 0x08u))
#define PTD                                  ((GPIO_Type *)(GPIO_BASE + 0x0Cu))
#define PTE                                  ((GPIO_Type *)(GPIO_BASE + 0x10u))
#define PTF                                  ((GPIO_Type *)(GPIO_BASE + 0x14u))
#define PTG                                  ((GPIO_Type *)(GPIO_BASE + 0x18u))
#define PTH                                  ((GPIO_Type *)(GPIO_BASE + 0x1Cu))
#define PTI                                  ((GPIO_Type *)(GPIO_BASE + 0x20u))
#define PTJ                                  ((GPIO_Type *)(GPIO_BASE + 0x24u))
#define PTK                                  ((GPIO_Type *)(GPIO_BASE + 0x28u))
#define PTL                                  ((GPIO_Type *)(GPIO_BASE + 0x2Cu))
#define PTM                                  ((GPIO_Type *)(GPIO_BASE + 0x30u))
#define PTN                                  ((GPIO_Type *)(GPIO_BASE + 0x34u))
#define PTO                                  ((GPIO_Type *)(GPIO_BASE + 0x38u))
#define PTP                                  ((GPIO_Type *)(GPIO_BASE + 0x3Cu))
/** Array initializer of GPIO peripheral base pointers */
#define GPIO_BASE_PTRS                       { PTC, PTD, PTE, PTF, PTG, PTH, PTI, PIJ, \
                                               PTK, PTL, PTM, PTN, PTO, PTP }

/** PORT - Register Layout Typedef */
typedef struct {
  __IO  uint16_t PCR[32];
} PORT_Type;
/** Peripheral PORT base pointer */
#define SIU_PCR_BASE                         (SIU->PCR)
#define SIU_IMUX_BASE                        (0xC3F91200u)
/* PORT - Peripheral instance base addresses */
#define PORTC                                ((PORT_Type *)(SIU_PCR_BASE + 0x0040))
#define PORTD                                ((PORT_Type *)(SIU_PCR_BASE + 0x0060))
#define PORTE                                ((PORT_Type *)(SIU_PCR_BASE + 0x0080))
#define PORTF                                ((PORT_Type *)(SIU_PCR_BASE + 0x00A0))
#define PORTG                                ((PORT_Type *)(SIU_PCR_BASE + 0x00C0))
#define PORTH                                ((PORT_Type *)(SIU_PCR_BASE + 0x00E0))
#define PORTI                                ((PORT_Type *)(SIU_PCR_BASE + 0x0100))
#define PORTJ                                ((PORT_Type *)(SIU_PCR_BASE + 0x0120))
#define PORTK                                ((PORT_Type *)(SIU_PCR_BASE + 0x0140))
#define PORTL                                ((PORT_Type *)(SIU_PCR_BASE + 0x0160))
#define PORTM                                ((PORT_Type *)(SIU_PCR_BASE + 0x0180))
#define PORTN                                ((PORT_Type *)(SIU_PCR_BASE + 0x01A0))
#define PORTO                                ((PORT_Type *)(SIU_PCR_BASE + 0x01C0))
#define PORTP                                ((PORT_Type *)(SIU_PCR_BASE + 0x01E0))
/** Array initializer of PORT peripheral base pointers */
#define PORT_BASE_PTRS                       { PORTC, PORTD, PORTE, PORTF, PORTG, PORTH, \
                                               PORTI, PORTJ, PORTK, PORTL, PORTM, PORTN, \
                                               PORTO, PORTP }

/* MCAN module features */

/* @brief MCAN Ram Start Address */
#define FEATURE_MCAN_MESSAGE_RAM_START_ADR  0xFFE34000U
/* @brief MCAN Max Number of supported Message Buffers as Rx */
#define FEATURE_MCAN_RX_MB_NUM              (64U)
/* @brief MCAN Max Number of supported Message Buffers as Tx */
#define FEATURE_MCAN_TX_MB_NUM              (32U)
/* @brief MCAN Max Number of standard ID elements used as FiltersID */
#define FEATURE_MCAN_STD_ID_NUM             (128U)
/* @brief MCAN Max Number of extended ID elements used as FiltersID */
#define FEATURE_MCAN_EXT_ID_NUM             (64U)
/* @brief MCAN Max Number of supported WORDS accessed by one interface */
#define FEATURE_MCAN_RAM_MESSAGES_WRD       (1216UL)
/* @brief MCAN Number of RxFIFOs */
#define FEATURE_MCAN_NO_RXFIFO				(2U)

/* TIMING_PAL module features */
/* @brief The issue: PIT and STM modules can not run if the stop in debug mode is enabled */
#define TIMING_PAL_HAS_PIT_STM_NOT_WORK_IN_DEBUG_MODE (1U)
/* @brief PIT default interrupt handler */
#define PIT_Ch0_IRQHandler   PIT_RTI0_IRQHandler

#define PIT_Ch1_IRQHandler   PIT_RTI1_IRQHandler

#define PIT_Ch2_IRQHandler   PIT_RTI2_IRQHandler

#define PIT_Ch3_IRQHandler   PIT_RTI3_IRQHandler
/* @brief STM default interrupt handler */
#define STM0_Ch0_IRQHandler   STM_CIR0_IRQHandler

#define STM0_Ch123_IRQHandler STM_CIR123_IRQHandler

/* TDM module features */

/*! @brief TDR count */
#define TDR_COUNT 6U

/* PASS module features */

/* @brief Has Region 0 */
#define FEATURE_PASS_HAS_RL0                  (0U)
/* @brief Has Region 1 */
#define FEATURE_PASS_HAS_RL1                  (1U)
/* @brief Has Region 2 */
#define FEATURE_PASS_HAS_RL2                  (2U)
/* @brief Has Region 3 */
#define FEATURE_PASS_HAS_RL3                  (3U)

/* PASS module features */

