ntek-jskim/SV300/third_party/nxp/devices/mpc57xx/mpc5777c_features.h
/* @brief Has Region 0 */
#define FEATURE_PASS_HAS_RL0                  (0U)
/* @brief Has Region 1 */
#define FEATURE_PASS_HAS_RL1                  (1U)
/* @brief Has Region 2 */
#define FEATURE_PASS_HAS_RL2                  (2U)
/* @brief Has Region 3 */
#define FEATURE_PASS_HAS_RL3                  (3U)

/* IGF module features */

/* @brief The Cluster channel for group 0 from channel 0 to 31 */
#define FEATURE_IGF_CLUSTER_CHANNEL_GROUP_0                  (0U)
/* @brief The Cluster channel for group 1 from channel 32 to 45 */
#define FEATURE_IGF_CLUSTER_CHANNEL_GROUP_1                  (32U)
/* @brief The max channel id of instance 0 */
#define FEATURE_IGF_MAX_CHANNEL_INSTANCE_0                  (29U)
/* @brief The max channel id of instance 1 */
#define FEATURE_IGF_MAX_CHANNEL_INSTANCE_1                  (45U)

#define FEATURE_IGF_MAX_CHANNEL_INSTANCE_ARRAY_DEFINE \
{                                        \
    FEATURE_IGF_MAX_CHANNEL_INSTANCE_0,              \
    FEATURE_IGF_MAX_CHANNEL_INSTANCE_1               \
}

/* ZIPWIRE module features */

/* @brief LFAST data rate change delay */
#define LFAST_DATA_RATE_CHANGE_DELAY 0xFU
/* @brief LFAST wakeup delay control register */
#define LFAST_WAKEUP_DELAY_CONTROL 0x12015402UL
/* @brief LFAST enable slave tx command */
#define LFAST_ENABLE_SLAVE_TX_CMD 0x31U
/* @brief LFAST check slave status command */
#define LFAST_CHECK_SLAVE_STATUS_CMD 0x0U
/* @brief LFAST enable slave pll command */
#define LFAST_ENABLE_SLAVE_PLL_CMD 0x02U
/* @brief LFAST change slave tx speed mode command */
#define LFAST_CHANGE_SLAVE_TX_SPEED_MODE_CMD 0x80U
/* @brief LFAST change slave rx speed mode command */
#define LFAST_CHANGE_SLAVE_RX_SPEED_MODE_CMD 0x10U
/* @brief Clock names for LFAST */
#define LFAST_CLOCK_NAMES {LFAST0_CLK}
/* @brief SIPI channel error flags masks */
#define SIPI_CH0_ERR_MASK 0xFFUL
#define SIPI_CH1_ERR_MASK 0xFF00UL
#define SIPI_CH2_ERR_MASK 0xFF0000UL
#define SIPI_CH3_ERR_MASK 0xFF000000UL
/* @brief SIPI channel count */
#define SIPI_CHANNEL_COUNT 4U
/* @brief SIPI streaming channel number */
#define SIPI_STREAMING_CH 2U
/* @brief SIPI reset timeout */
#define SIPI_RESET_TIMEOUT 10000U
/* @brief SIPI stream channel data register access */
#define SIPI_STREAM_DATA(x) (SIPI->CDR2[(x)])
/* @brief SIPI stream transfer length in bytes */
#define SIPI_STREAM_TRANSFER_LEN 8U
/* @brief SIPI data access macros */
#define SIPI_DATA_SHIFT(x) ((uint32_t)(0x18U & (0x18U << ((uint8_t)(x)))))
#define SIPI_DATA(x,y)     ((x) >> SIPI_DATA_SHIFT(y))
/* @brief SIPI interrupt lines count */
#define SIPI_IRQ_COUNT 1U
/* @brief SIPI ored interrupt lines */
#define SIPI_ORED_INT_LINES
/* @brief Clock names for SIPI */
#define SIPI_CLOCK_NAMES {SIPI0_CLK}

/* DECFILTER module features */
/* @brief PSI slave-bus interface exist */
#define FEATURE_DECFILTER_HAS_PSI          (1)
/* @brief debug enhanced exist */
#define FEATURE_DECFILTER_ENHANCED_DEBUG   (1)
/* @brief The DECFILTER has all ZeroIntegrateRead registers combined together */
#define FEATURE_DECFILTER_HAS_COMBINED_ZIR (1)
/* @brief trigger hardware trigger */
#define FEATURE_DECFILTER_HAS_TRIGGER      (1)

#endif /* MPC5777C_FEATURES_H */

/*******************************************************************************
 * EOF
 ******************************************************************************/
